[
  {
    "year": "",
    "headline": "Board of Trustees approval",
    "body": "On May 15, 1925, when the Stanford University Board of Trustees offi-\ncially approved the proposal to create the new School of Engineer-\ning, the decision was anything but the start of engineering at Stanford.\nThe education of engineers had been a founding intention for the university,\nwith an engineering curriculum in place since its inception.",
    "image_name": "Screen cap of BoT minutes?"
  },
  {
    "year": "1910-1915",
    "headline": "1910-1915 - The Engineering Corner",
    "body": "The southeast corner of Stanford’s main quad, known as “Engineering Corner,” circa 1910–1915.\nThe building was home to Engineering until 1977, when the school moved into the newly\nconstructed Frederick E. Terman Engineering Center. Special Collections & University Archives.",
    "image_name": "1910-1915_-_The_Engineering_Corner.jpg",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1910-1915_-_The_Engineering_Corner_lafzrp.jpg"
  },
  {
    "year": "1925-1936",
    "headline": "1925-1936 - Stanford Engineering's first dean",
    "body": "Theodore Jesse Hoover (1871-1955) graduated from Stanford in 1901 with a BA degree in geology and mining. After a career in the international mining industry, he returned to Stanford in 1919 as a professor of mining and metallurgy. He played a pivotal role in the formation of the new School of Engineering and served as its first dean from 1925 until his retirement in 1936. Hoover was the elder brother of Herbert Hoover, one of the first graduates of Stanford University in 1895 and the 31st President of the United States from 1929 to 1933. Special Collections & University Archives.",
    "image_name": "Copy of 8771.tif"
  },
  {
    "year": "1926",
    "headline": "1926 - The largest university electrical lab of its time",
    "body": "The Harris J. Ryan High-Voltage Laboratory debuted on September 17, 1926, with a public demonstration of its  2,100,000-volt test station containing six 350,000-volt transformer units, capable of producing the highest voltage  ever obtained at commercial frequency. Erected at a cost of nearly $500,000, it was the largest university electrical  lab in existence at the time. Berton W. Crandall photographs, Box 24, Hoover Institution Library & Archives.",
    "image_name": "Copy of ZZ050168.tif"
  },
  {
    "year": "",
    "headline": "The largest university electrical lab of its time",
    "body": "Professor Harris J. Ryan at his  High-Voltage Laboratory, where he  studied the long-distance transmission  of electricity, circa 1926. Ryan was head of the Department of Electrical Engineering from 1905 until 1931. Berton W. Crandall/Hoover Institution  Library & Archives."
  },
  {
    "year": "",
    "headline": "Two million volts",
    "body": "A railroad car filled with equipment for the Ryan  High-Voltage Laboratory.  With support from the city  of Los Angeles and five electrical power companies, the Ryan Laboratory was the first research lab at Stanford to be supported by external funding. Berton W. Crandall/Hoover Institution  Library & Archives.",
    "image_name": "PC0075_b01_f15_002.tif"
  },
  {
    "year": "",
    "headline": "The largest university electrical lab of its time",
    "body": "Stanford electrical  engineers in an  undated photograph.  Professor Harris J.  Ryan is seated 6th  from right. Berton W. Crandall/Hoover Institution Library & Archives.",
    "image_name": "Copy of ZZ050169.tif"
  },
  {
    "year": "",
    "headline": "The largest university electrical lab of its time",
    "body": "A 7-mile-long experimental high-voltage transmission  line was built on the 200 acres of land provided by  Stanford for the Harris J. Ryan High-Voltage Laboratory.  Today, the area is a faculty residential neighborhood  with a street and park named for Ryan.  Berton W. Crandall/Hoover Institution Library & Archives.",
    "image_name": "Copy of wd899qz9103_00_0001.jpg"
  },
  {
    "year": "",
    "headline": "The largest university electrical lab of its time",
    "body": "Located on Stanford Avenue, the Ryan High-Voltage Lab building—framed in  steel and covered in asbestos—was 173 feet long, 60 feet wide, and 65 feet high.  A 120-foot opening on one side of the building could be closed off by three  47-by-40-foot doors to create absolute darkness. Berton W. Crandall/Hoover Institution Library & Archives.",
    "image_name": "Copy of 00014490_015.jpg"
  },
  {
    "year": "1927",
    "headline": "1927 - Daniel Guggenheim Experimental Laboratory of Aerodynamic and Aeronautic Engineering ",
    "body": "Inside the Guggenheim Aeronautics Laboratory in 1927, Professor William F. Durand, who had joined the Stanford faculty in 1904, collaborated with Professor Everett P. Lesley to build one of the first wind tunnels, which enabled rigorous study of propeller design. Today, dozens of Durand’s hand-carved wooden propeller designs are on display in the Terman Engineering Library on the second floor of Stanford’s Jen-Hsun Huang Engineering Center. Berton W. Crandall/Hoover Institution Library & Archives.",
    "image_name": "Copy of 00007204_0003.jpg (Guggehneim Lab).jpg"
  },
  {
    "year": "1927",
    "headline": "1927 - Daniel Guggenheim Experimental Laboratory of Aerodynamic and Aeronautic Engineering ",
    "body": "In 1927, a gift from the Daniel Guggenheim Fund for the Promotion of Aeronautics helped create the new Daniel Guggenheim  Experimental Laboratory of Aerodynamic and Aeronautic Engineering, located in the Engineering Lab buildings. The gift included  $45,000 for equipment and $15,000 yearly for expenses for ten years. In this lab and others, Professor William F. Durand and his  colleagues studied aerodynamics, naval propulsion, and engineering research methods. Berton W. Crandall/Hoover Institution Library & Archives.",
    "image_name": "Copy of 00007002_0011.jpg (engineering lab exterior).jpg"
  },
  {
    "year": "",
    "headline": "Construction and Plans",
    "body": "Sidebar: Construction and Plans (excerpt from 1972 Stanford yearbook)",
    "image_name": "Copy of 00014490_015.jpg"
  },
  {
    "year": "",
    "headline": "Clipper Ships to Turbojets",
    "body": "Sidebar: Clipper Ships to Turbojets - The career of William Durand",
    "image_name": "Copy of ZZ070101.tif"
  },
  {
    "year": "1936-1944",
    "headline": "1936-1944 - Stanford Engineering's second Dean",
    "body": "Samuel B. Morris, professor of civil engineering and the second dean of the School of Engineering from 1936 to 1944, adjusted course schedules and curriculum during the Great Depression and World  War II to help students who needed to work or study during the summer. Hundreds of soldiers enrolled in 1943 as part of the  Army Specialized Training Program. Special Collections & University Archives.",
    "image_name": "ck707sy2214.jpg"
  },
  {
    "year": "",
    "headline": "Members of the Stanford Student Chapter of the American Society of Civil Engineers",
    "body": "Members of the Stanford Student Chapter of the American Society of Civil Engineers gather for a photo for the Stanford Quad yearbook, 1936. Charles Marx is seated sixth from right. Women were still a significant minority in engineering: the two women pictured are students Mary DeF. Atkins (sixth from left) and Margaret Woolverton (seventh from left), both seniors. Special Collections & University Archives.",
    "image_name": "00007000_0009.jpg"
  },
  {
    "year": "",
    "body": "Frederick Terman, 1938. Terman became head of the  Department of Electrical Engineering in 1937. He  served as dean of the School of Engineering from   1944 to 1958 and as provost of the university  from 1955 to 1965. Special Collections & University Archives.",
    "image_name": "kn908nr7305.jpg"
  },
  {
    "year": "1937",
    "headline": "1937 - Foundational technology in the burgeoning microwave industry",
    "body": "Type A klystron, 1937. The klystron was the first significantly powerful source of radio waves in the microwave range. As the foundational technology in the burgeoning microwave industry, it would be used in military radar detection, commercial air navigation, satellite communications,  high-energy particle accelerators, and other technologies. Special Collections  & University Archives.",
    "image_name": "00018325_004.jpg"
  },
  {
    "year": "1939",
    "headline": "1939 - Inventors of the klystron",
    "body": "Physics researchers Russell Varian (‘25, MA ‘27) and Sigurd Varian and Stanford physics professor William Hansen collaborated with colleagues in electrical engineering to invent the klystron. Posing with the klystron in 1939 are (clockwise from lower left) Russell H. Varian, Sigurd F. Varian, David L. Webster, William W. Hansen, and John R. Woodyard. Special Collections & University Archives.",
    "image_name": "00021082_004.jpg"
  },
  {
    "year": "",
    "body": "Brothers Russell H. Varian (left) and Sigurd Varian (right) went on to found Varian Associates, one of the earliest high-tech companies in Silicon Valley and the first to lease land from the university in what became the Stanford Industrial Park (renamed Stanford Research Park in 1974). Special Collections & University Archives.",
    "image_name": "zm384pb3271.jpg"
  },
  {
    "body": "Associate Professor William Hansen tests a unit of the  klystron in 1939. The klystron was based on his earlier invention,  the “rhumbatron.” Special Collections & University Archives.",
    "image_name": "00018323_004.jpg"
  },
  {
    "year": "1939",
    "headline": "1939 - Model 200A precision audio oscillator",
    "body": "William Hewlett and David Packard (seated), 1939. As graduate students in the School of Engineering, they developed the first precision audio oscillator, a low-cost method of measuring audio frequencies. The device became the foundation for their company, known around the world today as HP. Courtesy Hewlett-Packard Corporate Archives.",
    "image_name": "CC184.tif"
  },
  {
    "year": "",
    "body": "William Hewlett and David Packard\nworking together in their shop, circa 1942. Special Collections & University Archives.",
    "image_name": "zx844pk9013.jpg"
  },
  {
    "year": "",
    "headline": "Born in a Stanford Engineering Classroom: HP",
    "body": "Sidebar: Born in a Stanford Engineering Classroom: HP",
    "image_name": "nz029jf0057.jpg"
  },
  {
    "year": "1939",
    "headline": "1939 - Aviation and aeronautical engineering",
    "body": "Professor Arthur B. Domonoske, at right, 1939. Domonoske,  who joined Stanford in 1927 to become head of the Department  of Mechanical Engineering, published about the principles of aircraft engine design. Special Collections & University Archives.",
    "image_name": "1939_-_Aviation_and_aeronautical_engineering.jpg",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1939_-_Aviation_and_aeronautical_engineering_bwguek.jpg"
  },
  {
    "year": "",
    "body": "Engineering Corner with engineering buildings and the old clock tower, circa 1940. Special Collections & University Archives.",
    "image_name": "PC0141_b12_Engineering_Corner_0172.jpg"
  },
  {
    "year": "1943",
    "headline": "1943 - Training for war",
    "body": "Professor William G. Hoover demonstrates equipment to engineering students in the Army Specialized Training Program at Stanford, 1943. While keeping up with their regular course loads and research responsibilities, many faculty worked demanding hours to train these students for war. Special Collections & University Archives.",
    "image_name": "00002098_0011.jpg"
  },
  {
    "year": "",
    "body": "A student soldier in Stanford’s Army Specialized Training Program manipulates a mock plane rudder control handle to keep scales “on the beam” in front of him as his chair is moved to simulate a plane in flight. Special Collections & University Archives.",
    "image_name": "00002390_0001.jpg"
  },
  {
    "year": "1944",
    "headline": "1944 - Army Specialized Training Program",
    "body": "By 1944, more than half of the Army Specialized Training Program students at Stanford were in basic or advanced engineering. Thirteen hundred were taking basic engineering courses that included mathematics, chemistry, drawing, English, history, and geography. Four hundred fifty were advanced engineering students who, after completing the basics, went on to coursework in civil, mechanical, chemical, or electrical engineering. By comparison, at that time the school had only about one hundred graduate and upper-division civilian students specializing in engineering. Special Collections & University Archives.",
    "image_name": "1944_-_Army_Specialized_Training_Program_1.jpg",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1944_-_Army_Specialized_Training_Program_1_tsurqu.jpg"
  },
  {
    "year": "1944",
    "headline": "1944 - Army Specialized Training Program",
    "body": "Members of Stanford’s Army Specialized Training Program conduct  an electronics display outside the engineering buildings, January 1944. Special Collections  & University Archives.",
    "image_name": "00002098_0003.jpg"
  },
  {
    "year": "1944",
    "headline": "1944 - Stanford Engineering's third Dean",
    "body": "Fred Terman, dean of the School\nof Engineering, circa 1950. Samuel Morris recommended Frederick Terman to be his successor as\ndean of the School of Engineering. Terman, on leave from Stanford at\nthe time, had been serving since 1942 in a wartime appointment as\nhead of the top-secret Radio Research Laboratory at Harvard University.\nYet throughout the war, Terman was anticipating a period after the war he\nbelieved would be defined by unprecedented techno-\nlogical advancement led by engineers.\nDespite Terman’s absence, in December 1944 Stan-\nford President Donald Tresidder named Terman the third\ndean of the Stanford School of Engineering, with a strong\nendorsement from the engineering faculty. “Dr. Terman’s\nscholarly contributions in the field of electrical engineer-\ning and his administration of one of America’s largest war\nresearch projects place him among the outstanding engi-\nneers in the country,” Tresidder said, announcing Ter-\nman’s appointment. Terman would lead the\nSchool of Engineering through a now-legendary era of academic and technological innovation. Over the next\nten years, the School of Engineering would reach the\npinnacle of engineering education and lay the founda-\ntions of Silicon Valley. Special Collections & University Archives.",
    "image_name": "1944 - Stanford Engineering's third Dean.jpg",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1944_-_Stanford_Engineering_s_third_Dean_leujr9.jpg"
  },
  {
    "year": "1944-1945",
    "headline": "1944-1945 ",
    "body": "Hugh Hildreth Skilling, 1946. Skilling began his career at Stanford in 1926  as an undergraduate teaching assistant in physics. Promoted to associate professor in 1939, he later became head of the Department of Electrical Engineering, a post he held for twentythree years. He served as acting dean  of the School of Engineering from fall 1944 through the end of 1945. Stanford News Service.",
    "image_name": "NS537.tif"
  },
  {
    "headline": "1950s",
    "body": "Clarkson H. Oglesby originated the undergraduate construction option in civil engineering and in the mid-1950s helped expand it into a program leading to the MS, engineer, and doctoral degrees. Stanford News Service.",
    "image_name": "00020166_001.jpg"
  },
  {
    "year": "1947",
    "headline": "1947 - Mark I electron linear accelerator prototype",
    "body": "William W. Hansen with the 3-foot Mark I electron linear accelerator prototype, 1947. It was built, as all the Mark accelerators were, in the basement of the physics department in the Hansen Experimental Physics Lab (HEPL). Stanford News Service.",
    "image_name": "H376.tif"
  },
  {
    "year": "1949",
    "headline": "1949 - Mark III electron linear accelerator",
    "body": "First section of the Mark III linear accelerator, 1949. The accelerators were all built on campus at the Hansen  Experimental Physics Lab (HEPL) and were precursors to the 2-mile accelerator later built at SLAC. Stanford News Service.",
    "image_name": "U992.tif"
  },
  {
    "year": "1952",
    "headline": "1952 - Mark III linear accelerator",
    "body": "Mark III linear accelerator, 1952. This was one of many similarly named accelerators and detectors created and used at the W. W. Hansen Experimental Physics Laboratory (HEPL) and at the Stanford Linear Accelerator (SLAC). Stanford News Service.",
    "image_name": "U2516.tif"
  },
  {
    "year": "1950",
    "headline": "1950 - Recording meteors in the ionosphere",
    "body": "Electrical engineering faculty  Oswald Garrison Villard Jr. (MEng ’43, PhD ’49), right, and Allen M. Peterson (BS ’48, MS ’49, PhD ’52) with equipment used to record meteors in the ionosphere, August 1950. Their pioneering work on reflecting radar signals off the ionosphere led to Villard’s 1959 debut of “over-thehorizon” radar, which transcended  line-of-sight limitations and laid the foundation for advanced long-range surveillance and missile detection systems. Special Collections & University Archives.",
    "image_name": "00006955_0005.jpg"
  },
  {
    "year": "1948",
    "headline": "1948 - Father of applied mechanics",
    "body": "Stephen P. Timoshenko teaching a class, 1948. A renowned expert, teacher, and writer widely regarded as the “father” of applied mechanics in the United States, he was born in the Russian Empire in 1878. Timoshenko taught at Stanford from 1936 to 1963 and was instrumental in the formation of the Division of Engineering Mechanics in 1949. Special Collections & University Archives.",
    "image_name": "stephen-p-timoshenko.png",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861405/stephen-p-timoshenko_rr0uke.jpg"
  },
  {
    "year": "1951",
    "headline": "1951 - Edward L. Ginzton and the world's most powerful particle accelerator",
    "body": "Edward L. Ginzton with the Mark III linear accelerator, 1951. Ginzton earned his doctorate in electrical engineering at Stanford and was later appointed as a professor of electrical engineering and applied physics. He led a Stanford team that designed the world’s most powerful particle accelerator. Stanford News Service.",
    "image_name": "prof-edward-2.png",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861406/prof-edward-2_xecpct.jpg"
  },
  {
    "year": "1953",
    "headline": "1953 - The first medical linear accelerator",
    "body": "Professor Edward Ginzton, left, and Dr. Henry Kaplan, a Stanford Medicine radiologist, in front of klystron gauges, circa 1953. Kaplan and Ginzton coinvented North America’s first medical linear accelerator, a 6-million-volt machine constructed at the Stanford Medical Center, then in San Francisco. The Stanford device was first used in 1955, soon after a similar device debuted in England. Stanford News Service.",
    "image_name": "prof-edward-1.png",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861405/prof-edward-1_cfwklw.jpg"
  },
  {
    "year": "1952",
    "headline": "1952 - The dedication of the Hewlett-Packard wing",
    "body": "Left to right: David Packard, William Hewlett, and Dean  of Engineering Fred Terman attend the dedication of the  Hewlett-Packard wing in Stanford’s Electronics Research  Laboratory, 1952. Stanford News Service.",
    "image_name": "CC146.tif"
  },
  {
    "year": "1951",
    "headline": "1951 - The Electronics Research Laboratory",
    "body": "Housed in utilitarian buildings, the Electronics Research Laboratory (ERL) opened in 1951 and provided space for coordinating research operations in electrical engineering. The ERL was soon drawing $700,000 per year in research funding, resulting in expansion plans for an Applied Electronics Laboratory (AEL), approved just months later. Stanford University Planning Office.",
    "image_name": "00006962_0001.jpg"
  },
  {
    "year": "1960",
    "headline": "1960 - First female professor",
    "body": "Sidebar: Irmgard Flügge-Lotz, \"A Life Which Would Never Be Boring\" Stanford News Service",
    "image_name": "U4473.tif"
  },
  {
    "year": "1955",
    "headline": "1955 - The first programming course",
    "body": "John G. Herriot, professor of mathematics, when he became the first director of the newly founded Computation Center in 1953. In spring 1955, he taught the first programming course, “Theory and Operation of Computing Machines,” to twenty-five students using an IBM CardProgrammed Calculator, Model II. Computer Science was in the Department of Mathematics until 1985, when it was moved to the School of Engineering. Stanford News Service.",
    "image_name": "CC183.tif"
  },
  {
    "year": "1958-1972",
    "headline": "1958-1972 - Stanford Engineering's fourth Dean",
    "body": "Joseph Pettit, 1958. A professor of electrical engineering, Pettit served as dean of the School of Engineering from 1958 to 1972. He oversaw a time of growth for the school, during which the school became third in the nation in the number of advanced degrees conferred and the Department of Aeronautics and Astronautics, embracing the Space Age, was founded.  Special Collections & University Archives.",
    "image_name": "pettit_jn566pd7749.jpg"
  },
  {
    "year": "1963",
    "headline": "1963 - Polya Hall dedication",
    "body": "Dedication of the Computation Center at Polya Hall, 1963, when computer science was still part of the Department of Mathematics. The IBM 7090 or the Burroughs B5000 may be the machines pictured here. Special Collections & University Archives.",
    "image_name": "1653-11.tif"
  },
  {
    "year": "1958",
    "headline": "1958 - Four-layer Shockley diode",
    "body": "Left to right: Stanford electrical engineers John Linvill and James Gibbons, with Gerald Pearson of Bell Labs, March 1958. Gibbons, who would later become dean of the School of Engineering, holds a four-layer Shockley diode, the first semiconductor device ever made at Stanford—and presumably at any university. Gibbons had been taught to build semiconductor devices by William Shockley. Pearson, who had coinvented the solar cell battery while at Bell Labs, joined the Stanford electrical engineering faculty in 1960. Courtesy James Gibbons.",
    "image_name": "rm634fy8400.jpg"
  },
  {
    "year": "1959",
    "headline": "1959 - Stanford Radio Astronomy Observatory",
    "body": "Ronald Bracewell in 1959, standing in front of the Stanford Radio Astronomy Observatory, which he designed and built. Also known as Heliopolis, the Observatory was made up of thirty-two 10-foot-diameter parabolic antennas arranged in a cross. Together they measured solar activity and the sun’s temperature. The algorithms Bracewell developed to recreate images from scans were later used in computer-assisted tomography (CAT) scans for medical diagnosis. The array was demolished in 2006. Special Collections & University Archives.",
    "image_name": "U9427.tif"
  },
  {
    "year": "1961",
    "headline": "1961 - The Stanford Dish",
    "body": "The Stanford “Dish” radio telescope under construction in the Stanford foothills, 1961. A 70-ton, 150-foot steel and aluminum parabolic antenna with a surface spanning nearly half an acre, it was designed and built by the Stanford Research Institute for the U.S. government with support from the U.S. Air Force Office of Aerospace Research and the Defense Support Agency. In the 1940s, a group of Stanford’s electrical engineers––including Robert A. Helliwell, Laurence A. Manning, and O. G. Villard, Jr.—had tested the idea that radio signals bounced off meteor trails. As faculty, they formed the core of Stanford’s Radio Science Laboratory, later joined by professors Ronald Bracewell, Allen M. Peterson, and others. More than a decade later, the Dish enabled vastly expanded studies of scattering effects in the earth’s ionosphere and was used to detect Soviet radar by capturing radio signals that bounced off the moon. The Dish is still used today for satellite calibrations, spacecraft command and telemetry, and radio astronomy measurements.  Stanford News Service.",
    "image_name": "SC0122_s1_b267_f02_0115-01.jpg, PC0141_b12_Dish_0088.jpg"
  },
  {
    "year": "1963",
    "headline": "1963 - The multivator",
    "body": "Joshua Lederberg, Nobel laureate and chair of genetics, and Elliott Levinthal, professor of mechanical engineering, developed this device to test for life on distant planets. Although it was not included in the first Mars lander mission planned for 1966, in 1975 a modified version flew in the Viking Lander. Special Collections & University Archives.",
    "image_name": "SC0122_b1_Multivators_004.tif"
  },
  {
    "year": "1964",
    "headline": "1964 - The Optacon",
    "body": "John Linvill, left, and his daughter Candace demonstrating the Optacon, 1964. This portable device had a small handheld camera that could be moved across any printed material to generate images on a fingertipsized tactile display, allowing blind people to read printed text. After joining the Stanford faculty in 1955, Linvill founded the school’s Solid State Laboratory. Stanford News Service.",
    "image_name": "2263-6_Linvill copy.tiff"
  },
  {
    "year": "1954",
    "headline": "1954 - Crothers Memorial Hall dormitory",
    "body": "Engineering faculty at the groundbreaking for Crothers Memorial Hall dormitory, which  would house engineering graduate students, 1954. Special Collections & University Archives.",
    "image_name": "00005705_0023.jpg"
  },
  {
    "year": "1962",
    "headline": "1962 - Stanford Industrial Park",
    "body": "Map of the park, showing the growth  of Varian Associates, Hewlett-Packard,  Fairchild, Xerox, and  other businesses,  August 17, 1962.  Special Collections & University Archives.",
    "image_name": "SC0122_1981-087_b01_f005.jpg"
  },
  {
    "year": "1955",
    "headline": "1955 - Sanitary Engineering Laboratory",
    "body": "Joseph Frangini (standing) with students in the Sanitary Engineering Laboratory,  completed in the summer of 1955, which was equipped for chemical tests on water  and sewage. A world-renowned expert on fluid mechanics and water resources,  Frangini joined the Stanford faculty as a professor of civil engineering in 1950. Special Collections & University Archives.",
    "image_name": "00007005_0006.jpg"
  },
  {
    "year": "1966",
    "headline": "1966 - Stanford Artificial Intelligence Laboratory",
    "body": "John McCarthy, professor of computer science, playing computer chess, 1966. McCarthy coined the term artificial intelligence and founded the influential Stanford Artificial Intelligence Laboratory. The laboratory produced eighteen recipients of the ACM A. M. Turing Award, considered the Nobel Prize of computer science. Chuck Painter/Stanford News Service.",
    "image_name": "4382-011.tif"
  },
  {
    "year": "1961",
    "headline": "1961 - Nuclear Technology Laboratory",
    "body": "Nuclear reactor in Stanford’s Nuclear Technology Laboratory, in the former Harris J. Ryan High-Voltage Laboratory, 1961. The 10-kilowatt teaching reactor was on loan from the Atomic Energy Commission.  Stanford News Service.",
    "image_name": "ZZ031013.tif"
  },
  {
    "year": "1958",
    "headline": "1958 - Stanford's subcritical nuclear assembly",
    "body": "Engineering professor George Leppert (right) and graduate student Gary Vliet take measurements in Stanford’s subcritical nuclear assembly, 1958. The apparatus, which operated like a reactor but could not sustain a chain reaction, was located in Stanford’s Nuclear Technology Laboratory. The nuclear engineering program, led by Professor Leppert, was developed in the Mechanical Engineering Department in 1955. Stanford News Service.",
    "image_name": "U7477.jpg"
  },
  {
    "year": "1963",
    "headline": "1963 - Dedication of The Thomas F. Peterson Engineering Laboratory",
    "body": "Provost Frederick E. Terman (left), former dean of the School of Engineering, and Dean Joseph M. Pettit with Mrs. Thomas F. Peterson, 1963. The Thomas F. Peterson Engineering Laboratory—named in memory of her late husband, whose support made the facility  possible—was dedicated in May 1963. Stanford News Service.",
    "image_name": "SC0122_s1_b268_f06_1546-11.jpg"
  },
  {
    "year": "1965",
    "headline": "1965 - Dedication of the Frederick Emmons Terman Engineering Laboratory",
    "body": "Fred Terman and his family at the dedication of the Frederick Emmons Terman Engineering Laboratory,May 31, 1965. The renovated 16,000-square-foot building across from Engineering Corner—which had been the site of his office when he was chair of Electrical Engineering before World War II—was named in Terman’s honor just days after he had announced his retirement as Stanford vice president and provost. “If I could relive my life I could not do any better than to play the same record over again,” Terman said. Stanford News Service.",
    "image_name": "SC0122_s1_b269_f10_3000-09.jpg"
  },
  {
    "year": "1965",
    "headline": "1965 - Opening of the Jack A. McCullough Building",
    "body": "Opening of the Jack A. McCullough Building, 1965. Left to right: Mr. and Mrs. McCullough, Stanford trustee David Packard, and Stanford President Wallace Sterling. The building originally housed several groups focused on materials research, including the Center for Materials Research, which brought together faculty from engineering, physics, chemistry, and other fields. The center continues to support interdisciplinary materials research taking place in the Geballe Laboratory for Advanced Materials and the Stanford Institute for Materials and Energy Sciences. Stanford News Service.",
    "image_name": "SC0122_s1_b269_f13_3354-11.jpg"
  },
  {
    "year": "1972",
    "headline": "1972 - Chemical Engineering faculty meeting",
    "body": "Left to right: Michel Boudart, David Mason, John Lind, Douglass Wilde, Robert Madix, George Homsy, Channing Robertson, and Andreas Acrivos attend a Chemical Engineering faculty meeting, 1972. The department became part of the School of Engineering in 1960 but maintained close physical and intellectual ties to the Department of Chemistry. Courtesy Department of Chemical Engineering.",
    "image_name": "Faculty Meeting 1972 copy.tiff"
  },
  {
    "year": "1969",
    "headline": "1969 - Constrution of the William F. Durand Building for Space Engineering and Science",
    "body": "The William F. Durand Building for Space Engineering and Science, 1969. The building was built to house the Department of Aeronautics and Astronautics. During this time, the department was receiving more than $1 million in research funding each  year and more than two hundred graduate students enrolled, surpassing MIT as the nation’s largest producer of PhD graduates  in aeronautics and astronautics. Stanford News Service.",
    "image_name": "00005967_0003.jpg"
  },
  {
    "year": "1966",
    "headline": "1966 - Stanford Engineering facilities map",
    "body": "Campus facilities had been expanded, remodeled, and reconstructed almost continuously since the university opened its doors for students in 1891. At the time this map was published, some radio science research was conducted elsewhere in California and as far away as Antarctica.\nOne major new building, the Space Engineering Building (later named for William F. Durand), was under construction. A summary of the extensive facilities follows (numbers correspond to the buildings shown on the schematic drawing).\nSpecial Collections & University Archives.\n",
    "image_name": "Stanford Engineering News No. 58 Nov 1966.pdf"
  },
  {
    "year": "1973",
    "headline": "1973 -  First amateur radio from orbit",
    "body": "Electrical engineer Owen Garriott on board NASA’s Skylab 3, where he worked the first\namateur radio from orbit, 1973. He also performed three spacewalks, logging 14\nhours outside of Skylab. In the inaugural class of six scientist-astronauts selected\nby NASA in 1965, Garriott went on to fly on board a Space Shuttle mission in 1983,\nlogging a lifetime total of 69 days, 18 hours, and 56 minutes off the planet. NASA.\n",
    "image_name": "Owen Garriott_NASA.jpeg"
  },
  {
    "year": "1975",
    "headline": "1975 - Launch of the Center for Computer Research in Music and Acoustics (CCRMA)",
    "body": "Visitors from France at the Artificial Intelligence Lab on computer music, 1975. Seated from left: Pierre Boulez, Steve Martin; standing from left: Andy Moorer, John Chowning, and Max Mathews. A computational music group founded by Chowning evolved into the Center for Computer Research in Music and Acoustics (CCRMA), which launched in June 1975. Because of the growing reputation of the computer music group at Stanford,Boulez had asked the team to participate in the planning stages of a music research institute being formed at the Centre Pompidou in Paris. Stanford News Service.",
    "image_name": "E507-4.tif"
  },
  {
    "year": "1974",
    "headline": "1974 - Transmission Control Protocol (TCP)",
    "body": "Vinton Cerf in front of a blackboard filled with notes on Transmission Control Protocol/Internet Protocol (TCP/IP), circa 1974. TCP/IP, the foundational protocols that underpin the modern Internet, were developed by Cerf in collaboration with Robert Kahn of DARPA. Later, Cerf and Kahn were corecipients of the 2004 A. M. Turing Award for these pioneering contributions. Stanford News Service.",
    "image_name": "A645-9.tif"
  },
  {
    "year": 1969,
    "headline": "1969 - Prototype of a hydraulic arm",
    "body": "Mechanical Engineering student Victor Scheinman with a prototype hydraulic arm, 1969. The arm, now on display inside the Gates Computer Science Building, was one of two that were mounted to a table where researchers and students used it for research and teaching purposes for over twenty years, often focused on applications in the manufacturing industry. In 1974, a version of the Stanford Arm was able to assemble a Ford Model T water pump. The Board of Trustees of the Leland Stanford Junior University.",
    "image_name": "3523ScheinmanHydrArm.jpeg"
  },
  {
    "year": 1971,
    "headline": "1971 - Demonstration again the invasion of Laos",
    "body": "Students demonstrating against the invasion of Laos by the South Vietnamese with U.S. air support,  1971. The students seized the Computation Center during twelve hours of confrontation and violence  to protest the center’s use for war research. There were twelve arrests and no injuries.  Jose Mercado/Stanford News Service.",
    "image_name": "00015013_0001.jpg"
  },
  {
    "year": "1968-1969",
    "headline": "1968-1969 - Mechanical Engineering Design Division",
    "body": "Students in the Design Engineering class, 1968 and 1969. In the late 1950s, Stanford Engineering’s Mechanical Engineering Design Division pioneered a new approach to engineering and design education, emphasizing hands-on, experiential learning through environments, including the Design Loft and Machine Shop (today, Product Realization Lab). Under the leadership of faculty John E. Arnold and Robert H. McKim, the Product Design program focused on teaching design as a creative practice, integrating engineering, arts, natural science, social science, and the humanities into a comprehensive design education to address real-world needs. The division aimed to prepare engineers who developed the ability to integrate technical and artistic skills with social and environmental understanding to create innovative solutions for complex challenges. This comprehensive design approach set the foundation for a broader emphasis on interdisciplinary design, which later influenced the emergence of design practices like Smart Product Design and Interaction Design and, eventually, the Hasso Plattner Institute of Design (d.school). Stanford News Service.",
    "image_name": "SC0122_s1_b271_f05_6030-09.jpg\nSC0122_s1_b270_f10_5037-006.jpg\nSC0122_s1_b272_f05_7270-06.jpg\nSC0122_s1_b272_f05_7265-01.jpg\nSC0122_s1_b272_f05_7266-05.jpg"
  },
  {
    "year": 1969,
    "headline": "1969 - Stanford Instructional Television Network (SITN)",
    "body": "The control room for the Stanford Instructional Television Network (SITN), showing James Angell lecturing, 1969. This network allowed employees of member companies within a 50-mile range of Hoover Tower to take classes offered by the School of Engineering as part of the Honors Cooperative Program (HCP). When the HCP was founded in 1954, students had to come to campus to attend classes. With the founding of the SITN in 1969, students could begin attending the program remotely. The network eventually became part of the Stanford Center for Professional Development. Special Collections & University Archives.",
    "image_name": "SC0122_s1_b278_f04_C388-13.jpg"
  },
  {
    "year": 1968,
    "headline": "1968 - First woman to receive a PhD in computer science from Stanford University",
    "body": "Barbara Liskov, the first woman to receive a PhD  in computer science from Stanford University, 1968.  She was also among the first women to receive a PhD from a computer science department in the United States. For her PhD, Liskov worked with John McCarthy, focusing on chess endgames. In 2008, she became the second woman to receive the A. M. Turing Award.  Kenneth C. Zirkel/Wikimedia Commons.",
    "image_name": "Barbara_Liskov_computer_scientist_2010.jpg"
  },
  {
    "year": 1972,
    "headline": "1972 - Stanford's fifth Dean, William M. Kays",
    "body": "William M. Kays, May 1971. Kays began his career  at Stanford as an undergraduate in engineering (’42), earned his MS (’47) and PhD (’51) in mechanical engineering, and went on to join the faculty in that department. By 1961, he was department chairman and in 1972 was appointed dean of the School of Engineering, in which role he served until 1984. Under Kays’s leadership, all of Stanford’s engineering departments ranked in the top five in their graduate fields nationally. The school increased its external funding of research and expanded the number of students, particularly women. The Center for Integrated Systems and the John A. Blume Earthquake Engineering Center were both established during his tenure. Jose Mercado/Stanford News Service.",
    "image_name": "00019306_001.jpg"
  },
  {
    "year": 1972,
    "headline": "1972 - First black faculty member to hold a tenure-track appointment",
    "body": "Clayton Bates, professor of materials science and engineering and of electrical engineering, 1974. In 1972, following a ten-year career in industry, Bates became the first Black faculty member to hold a tenure-track appointment in the School of Engineering. Along with a group of graduate students, Bates founded the Stanford Society of Black Scientists and Engineers, an affiliate chapter of the National Society of Black Engineers. He also acted as a mentor and supporter of Black students in the areas of science, technology, engineering, and mathematics (STEM) and advocated for equity in STEM education. His expertise was in solid-state physics, and he was particularly interested in photoelectronic materials and devices. His work focused on the unraveling of processes involved in the interaction of photons and electrons with the very complex materials used in photoelectronic sensing devices. Stanford News Service.",
    "image_name": "SC0122_s1_b278_f01_C076-02.jpg"
  },
  {
    "year": 1972,
    "headline": "1972 - Kenneth Arrow wins the Nobel Prize",
    "body": "Kenneth Arrow, professor of operations research, at his press conference after winning the Nobel Prize in 1972. Arrow was on the faculty at Harvard University when he won the Nobel Prize for work he did while at Stanford for “pioneering contributions to general economic equilibrium theory and welfare theory.” Arrow returned to Stanford in 1979 and stayed until his retirement in 1991. Chuck Painter/Stanford News Service.",
    "image_name": "9919-11.tif"
  },
  {
    "year": 1974,
    "headline": "1974 - Engineering corner displays the school's new shield design",
    "body": "Engineering Corner, 1974. The new shield design for the School of Engineering, introduced in 1967, was added to the building in the early 1970s, before the school moved into its new home in the Terman Engineering Building in 1977. The mascle (diamond with the center removed) framework is orange, engineering’s academic color, on a blue background, denoting Stanford Engineering’s commitment to graduate education. The triple redwood fronds, found on all Stanford University heraldry, symbolize, first, “the organization, transmission, and generation of knowledge which takes place in the School and on which the scholarly growth of engineering depends,” and, second, “the tripartite character of Stanford’s School of Engineering—students, faculty, and alumni.” Special Collections & University Archives.",
    "image_name": "00005967_0003.jpg"
  },
  {
    "year": ""
  },
  {
    "year": ""
  },
  {
    "year": ""
  },
  {
    "year": ""
  },
  {
    "year": ""
  },
  {
    "year": ""
  },
  {
    "year": ""
  }
]