[
  {
    "year": "1910-1915",
    "heading": "The Engineering Corner",
    "body": "The southeast corner of Stanford’s main quad, known as “Engineering Corner,” circa 1910–1915. The building was home to Engineering until 1977, when the school moved into the newly constructed Frederick E. Terman Engineering Center.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567365/1910-1915_-_The_Engineering_Corner_eqcwnk.jpg"
  },
  {
    "year": "1926",
    "heading": "The largest university electrical lab of its time",
    "body": "Professor Harris J. Ryan at his High-Voltage Laboratory, where he studied the long-distance transmission of electricity, circa 1926. Ryan was head of the Department of Electrical Engineering from 1905 until 1931.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567986/1926_-_The_largest_university_electrical_lab_of_its_time_c3orrt.jpg"
  },
  {
    "year": "1936-1944",
    "heading": "Stanford Engineering's second Dean",
    "body": "A railroad car filled with equipment for thSamuel B. Morris, professor of civil engineering and the second dean of the School of Engineering from 1936 to 1944, adjusted course schedules and curriculum during the Great Depression and World War II to help students who needed to work or study during the summer. Hundreds of soldiers enrolled in 1943 as part of the Army Specialized Training Program.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567370/1936-1944_-_Stanford_Engineering_s_second_Dean_otpanz.jpg"
  },
  {
    "year": "1937",
    "heading": "Foundational technology in the burgeoning microwave industry",
    "body": "Type A klystron, 1937. The klystron was the first significantly powerful source of radio waves in the microwave range. As the foundational technology in the burgeoning microwave industry, it would be used in military radar detection, commercial air navigation, satellite communications, high-energy particle accelerators, and other technologies. With the klystron, Terman began the school’s decades-long tradition of inventions emerging from academia and making a successful transfer to the corporate world.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567641/1937_-_Foundational_technology_in_the_burgeoning_microwave_industry_wn5tnx.jpg"
  },
  {
    "year": "1939",
    "heading": "Inventors of the klystron",
    "body": "Type A klystron, 1937. The klystron was the first significantly powerful source of radio waves in the microwave range. As the foundational technology in the burgeoning microwave industry, it would be used in military radar detection, commercial air navigation, satellite communications, high-energy particle accelerators, and other technologies. With the klystron, Terman began the school’s decades-long tradition of inventions emerging from academia and making a successful transfer to the corporate world.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567364/1939_-_Inventors_of_the_klystron_ocfvjf.jpg"
  },
  {
    "year": "1939",
    "heading": "Model 200A precision audio oscillator",
    "body": "William Hewlett and David Packard (seated), 1939. As graduate students in the School of Engineering, they developed the first precision audio oscillator, a low-cost method of measuring audio frequencies. The device became the foundation for their company, known around the world today as HP. Hewlett and Packard had been motivated to create the Model 200A during a lecture byTer- man, who read from a 1934 paper by Bell Lab- oratories’ H.S. Black on distortion reduction techniques. Hewlett was so inspired that he committed his master’s thesis to the concept. That same year, at Terman’s urging, the young engineers pitched the Model 200A to the Walt Disney Company, which was pro- ducing the animated film Fantasia with a soundtrack of beloved classical music. The Model 200A provided the technological foundation for Disney’s “Fantasound” high- fidelity audio reproduction system, and the Hewlett-Packard Company, named for its founders, was off and running. In subsequent decades, its technological strides would make the company a household name.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567986/1939_-_Model_200A_precision_audio_oscillator_cetgvd.jpg"
  },
  {
    "year": "1939",
    "heading": "Aviation and aeronautical engineering",
    "body": "Professor Arthur B. Domonoske, at right, 1939. Domonoske, who joined Stanford in 1927 to become head of the Department of Mechanical Engineering, published about the principles of aircraft engine design. In the decade or so between the advent of human flight and World War I, then known simply as “The Great War,” Stanford faculty worked in the vanguard of aviation and aeronautical engineering. By the late 1930s, aviation was at the cusp of a great transition as World War II loomed. As Germany invaded Poland in September 1939, the Department of Mechanical Engineering took in the Guggenheim Lab. Research relationships with the federal government were bur- geoning; the Civil Aeronautics Authority, precur- sor to the Federal Aviation Administration, selected Stanford as one of several centers nationwide to train civilians in aviation.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567639/1939_-_Aviation_and_aeronautical_engineering_ioj0ct.jpg"
  },
  {
    "year": "1943",
    "heading": "Training for war",
    "body": "Professor William G. Hoover demonstrates equipment to engineering students in the Army Specialized Training Program at Stanford, 1943. While keeping up with their regular course loads and research responsibilities, many faculty worked demanding hours to train these students for war. In 1941, preceding the attack on Pearl Harbor, Washington frequently called on Stanford to support defense activities, asking for help not only from the School of Engineering but also from the departments of physics and chem- istry and the School of Medicine, seeking any experts who might give the coun- try an edge in the coming conflict.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567369/1943_-_Training_for_war_ooznx0.jpg"
  },
  {
    "year": "1944",
    "heading": "Army Specialized Training Program",
    "body": "By 1944, more than half of the Army Specialized Training Program students at Stanford were in basic or advanced engineering. Thirteen hundred were taking basic engineering courses that included mathematics, chemistry, drawing, English, history, and geography. Four hundred fifty were advanced engineering students who, after completing the basics, went on to coursework in civil, mechanical, chemical, or electrical engineering. By comparison, at that time the school had only about one hundred graduate and upper-division civilian students specializing in engineering.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567642/1944_-_Army_Specialized_Training_Program_1_znbx9w.jpg"
  },
  {
    "year": "1944",
    "heading": "Stanford Engineering's third Dean",
    "body": "Fred Terman, dean of the School of Engineering, circa 1950. Samuel Morris recommended Frederick Terman to be his successor as dean of the School of Engineering. Terman, on leave from Stanford at the time, had been serving since 1942 in a wartime appointment as head of the top-secret Radio Research Laboratory at Harvard University. Yet throughout the war, Terman was anticipating a period after the war he believed would be defined by unprecedented techno- logical advancement led by engineers. Despite Terman’s absence, in December 1944 Stan- ford President Donald Tresidder named Terman the third dean of the Stanford School of Engineering, with a strong endorsement from the engineering faculty. “Dr. Terman’s scholarly contributions in the field of electrical engineer- ing and his administration of one of America’s largest war research projects place him among the outstanding engi- neers in the country,” Tresidder said, announcing Ter- man’s appointment. Terman would lead the School of Engineering through a now-legendary era of academic and technological innovation. Over the next ten years, the School of Engineering would reach the pinnacle of engineering education and lay the founda- tions of Silicon Valley.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1734567639/1944_-_Stanford_Engineering_s_third_Dean_yloixx.jpg"
  }
]