[
  {
    "body": "On May 15, 1925, when the Stanford University Board of Trustees offi-\r\ncially approved the proposal to create the new School of Engineer-\r\ning, the decision was anything but the start of engineering at Stanford.\r\nThe education of engineers had been a founding intention for the university,\r\nwith an engineering curriculum in place since its inception.",
    "year": "1925",
    "heading": "Board of Trustees approval",
    "alt": "A building sign displaying the word \"Engineering\" prominently, indicating the facility's purpose and focus.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265172/PC0141_b10_Engineering_Corner_0511_EWS2_yxv22y.jpg",
    "uuid": "2081e9aa-7622-4228-a17a-f65fb10e1d85",
    "anchor": "1925-board-of-trustees-approval"
  },
  {
    "body": "The southeast corner of Stanford’s main quad, known as “Engineering Corner,” circa 1910–1915.\r\nThe building was home to Engineering until 1977, when the school moved into the newly\r\nconstructed Frederick E. Terman Engineering Center. Special Collections & University Archives.",
    "year": "1910-1915",
    "heading": "The Engineering Corner",
    "alt": "Black and white photograph of a building with prominent arches.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265190/Copy_of_00012017_005_e0a3bb.jpg",
    "uuid": "fce47271-38d7-423c-af44-b8efcd92fd62",
    "anchor": "1910-1915-the-engineering-corner"
  },
  {
    "body": "Theodore Jesse Hoover (1871-1955) graduated from Stanford in 1901 with a BA degree in geology and mining. After a career in the international mining industry, he returned to Stanford in 1919 as a professor of mining and metallurgy. He played a pivotal role in the formation of the new School of Engineering and served as its first dean from 1925 until his retirement in 1936. Hoover was the elder brother of Herbert Hoover, one of the first graduates of Stanford University in 1895 and the 31st President of the United States from 1929 to 1933. Special Collections & University Archives.",
    "year": "1925-1936",
    "heading": "Stanford Engineering's first dean",
    "alt": "A black and white photo featuring a man dressed in a formal suit and tie.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265157/theodore_hoover_yiel9t.jpg",
    "uuid": "4141845b-fea3-48b7-b068-075646f8a4e9",
    "anchor": "1925-1936-stanford-engineerings-first-dean"
  },
  {
    "body": "The Harris J. Ryan High-Voltage Laboratory debuted on September 17, 1926, with a public demonstration of its  2,100,000-volt test station containing six 350,000-volt transformer units, capable of producing the highest voltage  ever obtained at commercial frequency. Erected at a cost of nearly $500,000, it was the largest university electrical  lab in existence at the time. Berton W. Crandall photographs, Box 24, Hoover Institution Library & Archives.",
    "year": "1926",
    "heading": "Harris J. Ryan lab debuts with 2.1M-Volt demo",
    "alt": "A man stands on a fiery platform, showcasing a dramatic and intense scene.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265224/high_voltage_laboratory_moonff.jpg",
    "uuid": "e59020ca-fc92-4475-9a81-846231d6d56a",
    "anchor": "1926-harris-j-ryan-lab-debuts-with-21m-volt-demo"
  },
  {
    "body": "Professor Harris J. Ryan at his  High-Voltage Laboratory, where he  studied the long-distance transmission  of electricity, circa 1926. Ryan was head of the Department of Electrical Engineering from 1905 until 1931. Berton W. Crandall/Hoover Institution  Library & Archives.",
    "year": "1926",
    "heading": "Professor Harris J. Ryan in his High-Voltage Lab ",
    "alt": "A man in formal attire stands beside a sophisticated machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1741727933/harris_j_ryan_gw6by8.jpg",
    "uuid": "b7eb9e3b-60de-4f02-9991-303e553b27ae",
    "anchor": "1926-professor-harris-j-ryan-in-his-high-voltage-lab"
  },
  {
    "body": "A railroad car filled with equipment for the Ryan High-Voltage Laboratory. With support from the city  of Los Angeles and five electrical power companies, the Ryan Laboratory was the first research lab at Stanford to be supported by external funding. Berton W. Crandall/Hoover Institution  Library & Archives.",
    "year": "1926",
    "heading": "Equipment for the Ryan High-Voltage Lab",
    "alt": "a group of men positioned next to a train, with a sign reading \"Two Million Volts\" prominently displayed in the background.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265176/railroad_car_geoxb2.jpg",
    "uuid": "65b96b71-3aa5-480f-bcb8-601a1a63666a",
    "anchor": "1926-equipment-for-the-ryan-high-voltage-lab"
  },
  {
    "body": "Stanford electrical engineers in an undated photograph. Professor Harris J. Ryan is seated 6th from right. Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1926",
    "heading": "A Moment in Time: Stanford electrical engineers with Prof. Ryan",
    "alt": "A group of men in formal suits and hats, seated together.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "6ec3fc1b-f00a-47d3-ad87-ddaeafe81f44",
    "anchor": "1926-a-moment-in-time-stanford-electrical-engineers-with-prof-ryan"
  },
  {
    "body": "View southward of experimental power lines from the Ryan Lab. Ryan’s research helped overcome many vexing challenges of transporting electricity, including how to carry electricity from the Hoover Dam to Los Angeles. Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1926",
    "heading": "Powering Progress: A Glimpse at Experimental Power Lines from Ryan Lab",
    "alt": "Black and white image of a substantial building, highlighting electrical equipment in the surrounding area.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265174/experimental_power_lines_lbvixo.jpg",
    "uuid": "89507700-8526-40a5-94d9-5d3b0b58ff15",
    "anchor": "1926-powering-progress-a-glimpse-at-experimental-power-lines-from-ryan-lab"
  },
  {
    "body": "A 7-mile-long experimental high-voltage transmission line was built on the 200 acres of land provided by Stanford for the Harris J. Ryan High-Voltage Laboratory. Today, the area is a faculty residential neighborhood with a street and park named for Ryan.  Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1926",
    "heading": "\r\n7-mile experimental high-voltage transmission line",
    "alt": "A vintage black and white photo depicting a rustic farm with a classic barn in the foreground.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265158/wd899qz9103_00_0001_EWS_vhj8r8.jpg",
    "uuid": "8d326d3d-1462-4290-8db6-e82d8c95cee9",
    "anchor": "1926-7-mile-experimental-high-voltage-transmission-line"
  },
  {
    "body": "Located on Stanford Avenue, the Ryan High-Voltage Lab building—framed in  steel and covered in asbestos—was 173 feet long, 60 feet wide, and 65 feet high.  A 120-foot opening on one side of the building could be closed off by three  47-by-40-foot doors to create absolute darkness. Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1926",
    "heading": "Stanford’s High-Voltage Lab: A literal powerhouse",
    "alt": "A black and white image featuring a weathered barn next to a prominent white building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265196/Copy_of_00014490_015_mfcej3.jpg",
    "uuid": "f985b1d1-ea93-446d-a037-f9e91c4b1dfc",
    "anchor": "1926-stanfords-high-voltage-lab-a-literal-powerhouse"
  },
  {
    "body": "Inside the Guggenheim Aeronautics Laboratory in 1927, Professor William F. Durand, who had joined the Stanford faculty in 1904, collaborated with Professor Everett P. Lesley to build one of the first wind tunnels, which enabled rigorous study of propeller design. Today, dozens of Durand’s hand-carved wooden propeller designs are on display in the Terman Engineering Library on the second floor of Stanford’s Jen-Hsun Huang Engineering Center. Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1927",
    "heading": "From hand-carved to historic: Durand’s propellers on display",
    "alt": "A black and white image of a man standing in a room beside a large machine and three men in the background.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265194/Copy_of_00007204_0003.jpg_Guggehneim_Lab_yvaovr.jpg",
    "uuid": "081f29b7-1a90-41e4-b39b-42a6a661328e",
    "anchor": "1927-from-hand-carved-to-historic-durands-propellers-on-display"
  },
  {
    "body": "In 1927, a gift from the Daniel Guggenheim Fund for the Promotion of Aeronautics helped create the new Daniel Guggenheim  Experimental Laboratory of Aerodynamic and Aeronautic Engineering, located in the Engineering Lab buildings. The gift included  $45,000 for equipment and $15,000 yearly for expenses for ten years. In this lab and others, Professor William F. Durand and his  colleagues studied aerodynamics, naval propulsion, and engineering research methods. Berton W. Crandall/Hoover Institution Library & Archives.",
    "year": "1927",
    "heading": "Stanford’s Guggenheim Experimental Lab advances Aeronautics",
    "alt": "A black and white image offour men talking and standing next to a plane parked in front of a building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265189/Copy_of_00007002_0011.jpg_engineering_lab_exterior_tkaady.jpg",
    "uuid": "6f217ca3-4ec9-4bdf-bfe8-9838d733bc9d",
    "anchor": "1927-stanfords-guggenheim-experimental-lab-advances-aeronautics"
  },
  {
    "body": "Sidebar: Construction and Plans (excerpt from 1972 Stanford yearbook)",
    "year": "1972",
    "heading": "Construction and Plans",
    "alt": "A black and white image depicting a large building alongside a traditional barn.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265196/Copy_of_00014490_015_mfcej3.jpg",
    "uuid": "5bb41c17-507b-4e81-aff6-7bae9f6b637b",
    "anchor": "1972-construction-and-plans"
  },
  {
    "body": "Sidebar: Clipper Ships to Turbojets - The career of William Durand",
    "year": "This is an entire subsection about the career of William Durand, perhaps we hold off on including this in the timeline and consider how to include it as part of the full chapter?",
    "heading": "Clipper Ships to Turbojets",
    "alt": "An older man with a beard wearing a suit is captured in a black and white photograph.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265423/william_durand_lwurlu.jpg",
    "uuid": "046f12b6-1a5f-4cde-b9ba-f70bdba9d5d4",
    "anchor": "This is an entire subsection about the career of William Durand, perhaps we hold off on including this in the timeline and consider how to include it as part of the full chapter?-clipper-ships-to-turbojets"
  },
  {
    "body": "Samuel B. Morris, professor of civil engineering and the second dean of the School of Engineering from 1936 to 1944, adjusted course schedules and curriculum during the Great Depression and World  War II to help students who needed to work or study during the summer. Hundreds of soldiers enrolled in 1943 as part of the  Army Specialized Training Program. Special Collections & University Archives.",
    "year": "1936-1944",
    "heading": "Stanford Engineering's Second Dean",
    "alt": "A black and white portrait of a man wearing a suit and tie.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265143/ck707sy2214_h2kuty.jpg",
    "uuid": "e581cd05-3065-4818-a28c-295a7857f3dc",
    "anchor": "1936-1944-stanford-engineerings-second-dean"
  },
  {
    "body": "Members of the Stanford Student Chapter of the American Society of Civil Engineers gather for a photo for the Stanford Quad yearbook, 1936. Charles Marx is seated sixth from right. Women were still a significant minority in engineering: the two women pictured are students Mary DeF. Atkins (sixth from left) and Margaret Woolverton (seventh from left), both seniors. Special Collections & University Archives.",
    "year": "1936",
    "heading": "Members of the Stanford Student Chapter of the American Society of Civil Engineers",
    "alt": "A vintage black and white photograph depicting a diverse group of men and women gathered together posing for a photo.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "c80f2ad8-8f1d-4091-bdc1-ceefd7c7d653",
    "anchor": "1936-members-of-the-stanford-student-chapter-of-the-american-society-of-civil-engineers"
  },
  {
    "body": "Frederick Terman, 1938. Terman became head of the Department of Electrical Engineering in 1937. He served as dean of the School of Engineering from 1944 to 1958 and as provost of the university from 1955 to 1965. Special Collections & University Archives.",
    "year": "1938",
    "heading": "Visionary Leadership: Frederick Terman Shaping Stanford's Engineering Legacy as Department Head and Dean",
    "alt": "A man wearing glasses sits at a desk, smiling for a picture.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/kn908nr7305_dxr5db.jpg",
    "uuid": "0779f5a0-18ff-4035-9fdf-180361496f15",
    "anchor": "1938-visionary-leadership-frederick-terman-shaping-stanfords-engineering-legacy-as-department-head-and-dean"
  },
  {
    "body": "Type A klystron, 1937. The klystron was the first significantly powerful source of radio waves in the microwave range. As the foundational technology in the burgeoning microwave industry, it would be used in military radar detection, commercial air navigation, satellite communications,  high-energy particle accelerators, and other technologies. Special Collections  & University Archives.",
    "year": "1937",
    "heading": "Foundational technology in the burgeoning microwave industry",
    "alt": "Black and white photograph of a machine, highlighting a distinct metal part, emphasizing its mechanical structure and details.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265186/00018325_004_s9kcul.jpg",
    "uuid": "72ddbccf-e214-4af1-9db7-d9742c5535da",
    "anchor": "1937-foundational-technology-in-the-burgeoning-microwave-industry"
  },
  {
    "body": "Physics researchers Russell Varian (‘25, MA ‘27) and Sigurd Varian and Stanford physics professor William Hansen collaborated with colleagues in electrical engineering to invent the klystron. Posing with the klystron in 1939 are (clockwise from lower left) Russell H. Varian, Sigurd F. Varian, David L. Webster, William W. Hansen, and John R. Woodyard. Special Collections & University Archives.",
    "year": "1939",
    "heading": "Inventors of the klystron",
    "alt": "A group of men examining a camera in a room, attentively observing and discussing its operation and design.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265206/00021082_004_ptdepc.jpg",
    "uuid": "a1bd18c3-a8c6-4dd5-b5c4-b2643cd7b388",
    "anchor": "1939-inventors-of-the-klystron"
  },
  {
    "body": "Brothers Russell H. Varian (left) and Sigurd Varian (right) went on to found Varian Associates, one of the earliest high-tech companies in Silicon Valley and the first to lease land from the university in what became the Stanford Industrial Park (renamed Stanford Research Park in 1974). Special Collections & University Archives.",
    "year": "1939",
    "heading": "The Varian brothers",
    "alt": "Two men stand beside a machine, engaged in conversation or observation of the equipment.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265205/zm384pb3271_t5ac1m.jpg",
    "uuid": "226f0780-1e55-4dbf-a90b-ee9b7ca58def",
    "anchor": "1939-the-varian-brothers"
  },
  {
    "body": "Associate Professor William Hansen tests a unit of the  klystron in 1939. The klystron was based on his earlier invention,  the “rhumbatron.” Special Collections & University Archives.",
    "year": "1939",
    "heading": "Trailblazing Technology: Associate Professor William Hansen Tests the Klystron",
    "alt": "A man in a suit and tie operates a machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265204/00018323_004_myytao.jpg",
    "uuid": "efb51273-60a9-4fac-932a-51803ca68ecf",
    "anchor": "1939-trailblazing-technology-associate-professor-william-hansen-tests-the-klystron"
  },
  {
    "body": "William Hewlett and David Packard (seated), 1939. As graduate students in the School of Engineering, they developed the first precision audio oscillator, a low-cost method of measuring audio frequencies. The device became the foundation for their company, known around the world today as HP. Courtesy Hewlett-Packard Corporate Archives.",
    "year": "1939",
    "heading": "Model 200A precision audio oscillator",
    "alt": "Two men collaboratively working on a sound board.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1741906509/hewlett_packard_yijywt.jpg",
    "uuid": "5738b7a9-7fdf-47f1-bc67-4d1f4d03c19a",
    "anchor": "1939-model-200a-precision-audio-oscillator"
  },
  {
    "body": "William Hewlett and David Packard working together in their shop, circa 1942. Special Collections & University Archives.",
    "year": "1942",
    "heading": "Founding Innovation: William Hewlett and David Packard Collaborate in Their Workshop",
    "alt": "Two men stand adjacent to one another, likely involved in a discussion or interaction.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265160/zx844pk9013_j3dof4.jpg",
    "uuid": "5703bf2f-2e62-42d5-a7fb-28214ebc89fb",
    "anchor": "1942-founding-innovation-william-hewlett-and-david-packard-collaborate-in-their-workshop"
  },
  {
    "body": "Professor Arthur B. Domonoske, at right, 1939. Domonoske,  who joined Stanford in 1927 to become head of the Department  of Mechanical Engineering, published about the principles of aircraft engine design. Special Collections & University Archives.",
    "year": "1939",
    "heading": "Aviation and aeronautical engineering",
    "alt": "Two men in suits stand beside a large machine, engaged in discussion or observation of its operation.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265211/00008355_001_izvi7r.jpg",
    "uuid": "53bba9c2-42ed-4941-a1a6-12726cc7d583",
    "anchor": "1939-aviation-and-aeronautical-engineering"
  },
  {
    "body": "Engineering Corner with engineering buildings and the old clock tower, circa 1940. Special Collections & University Archives.",
    "year": "1940",
    "heading": "A Timeless Tradition: Engineering Corner and the Iconic Clock Tower",
    "alt": "An old black and white photo depicting people riding bicycles in front of a historic building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265162/PC0141_b12_Engineering_Corner_0172_nxsc55.jpg",
    "uuid": "d2c55953-3b64-43d0-8ec5-efafb75871c0",
    "anchor": "1940-a-timeless-tradition-engineering-corner-and-the-iconic-clock-tower"
  },
  {
    "body": "Professor William G. Hoover demonstrates equipment to engineering students in the Army Specialized Training Program at Stanford, 1943. While keeping up with their regular course loads and research responsibilities, many faculty worked demanding hours to train these students for war. Special Collections & University Archives.",
    "year": "1943",
    "heading": "Training for war",
    "alt": "Six men, five in uniform and one in a suit, gather around a control panel.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265174/00002098_0011_ge5nki.jpg",
    "uuid": "6b33858c-d388-493a-9810-6562c8b9aaaa",
    "anchor": "1943-training-for-war"
  },
  {
    "body": "A student soldier in Stanford’s Army Specialized Training Program manipulates a mock plane rudder control handle to keep scales “on the beam” in front of him as his chair is moved to simulate a plane in flight. Special Collections & University Archives.",
    "year": "1943",
    "heading": "Stanford's Army Specialized Training Program",
    "alt": "Three men in a room, one testing a machine, another adjusting settings, and the last taking notes.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "1b7f7edc-13b7-462e-a804-e9e0506f7fa8",
    "anchor": "1943-stanfords-army-specialized-training-program"
  },
  {
    "body": "By 1944, more than half of the Army Specialized Training Program students at Stanford were in basic or advanced engineering. Thirteen hundred were taking basic engineering courses that included mathematics, chemistry, drawing, English, history, and geography. Four hundred fifty were advanced engineering students who, after completing the basics, went on to coursework in civil, mechanical, chemical, or electrical engineering. By comparison, at that time the school had only about one hundred graduate and upper-division civilian students specializing in engineering. Special Collections & University Archives.",
    "year": "1944",
    "heading": "Students in Stanford's Army Specialized Training Program enroll in engineering courses",
    "alt": "A group of men gathered around a large industrial machine, engaged in discussion and observation of its operation.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265174/00002098_0011_ge5nki.jpg",
    "uuid": "5a8a00d1-77da-44b2-bd76-10547a3d9e90",
    "anchor": "1944-students-in-stanfords-army-specialized-training-program-enroll-in-engineering-courses"
  },
  {
    "body": "Members of Stanford’s Army Specialized Training Program conduct  an electronics display outside the engineering buildings, January 1944. Special Collections  & University Archives.",
    "year": "1944",
    "heading": "Stanford’s Army Training Program demonstrate work in electronics",
    "alt": "Two men dressed in military attire work together on a machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265182/00002098_0003_tng0js.jpg",
    "uuid": "3226170c-712f-4289-819e-079ea363dd8e",
    "anchor": "1944-stanfords-army-training-program-demonstrate-work-in-electronics"
  },
  {
    "body": "Fred Terman, dean of the School\r\nof Engineering, circa 1950. Samuel Morris recommended Frederick Terman to be his successor as\r\ndean of the School of Engineering. Terman, on leave from Stanford at\r\nthe time, had been serving since 1942 in a wartime appointment as\r\nhead of the top-secret Radio Research Laboratory at Harvard University.\r\nYet throughout the war, Terman was anticipating a period after the war he\r\nbelieved would be defined by unprecedented techno-\r\nlogical advancement led by engineers.\r\nDespite Terman’s absence, in December 1944 Stan-\r\nford President Donald Tresidder named Terman the third\r\ndean of the Stanford School of Engineering, with a strong\r\nendorsement from the engineering faculty. “Dr. Terman’s\r\nscholarly contributions in the field of electrical engineer-\r\ning and his administration of one of America’s largest war\r\nresearch projects place him among the outstanding engi-\r\nneers in the country,” Tresidder said, announcing Ter-\r\nman’s appointment. Terman would lead the\r\nSchool of Engineering through a now-legendary era of academic and technological innovation. Over the next\r\nten years, the School of Engineering would reach the\r\npinnacle of engineering education and lay the founda-\r\ntions of Silicon Valley. Special Collections & University Archives.",
    "year": "1944",
    "heading": "Stanford Engineering's third Dean",
    "alt": " A black and white portrait of a man wearing a suit in glasses.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265195/terman_qm422bp1949_5.57.39_PM_pkfzoq.jpg",
    "uuid": "2d231355-68a3-4acf-9122-1877cc8d567f",
    "anchor": "1944-stanford-engineerings-third-dean"
  },
  {
    "body": "Hugh Hildreth Skilling, 1946. Skilling began his career at Stanford in 1926  as an undergraduate teaching assistant in physics. Promoted to associate professor in 1939, he later became head of the Department of Electrical Engineering, a post he held for twenty three years. He served as acting dean  of the School of Engineering from fall 1944 through the end of 1945. Stanford News Service.",
    "year": "1944-1945",
    "heading": "Skilling’s 23 years as head of electrical engineering at Stanford",
    "alt": "A black and white photograph featuring a man dressed in a formal suit.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265183/hugh_skilling_uzvnx3.jpg",
    "uuid": "4d475a0f-e860-4e56-8295-889a94adfffc",
    "anchor": "1944-1945-skillings-23-years-as-head-of-electrical-engineering-at-stanford"
  },
  {
    "body": "Clarkson H. Oglesby originated the undergraduate construction option in civil engineering and in the mid-1950s helped expand it into a program leading to the MS, engineer, and doctoral degrees. Stanford News Service.",
    "year": "1950s",
    "heading": "Clarkson Oglesby pioneers construction option in civil engineering",
    "alt": "A black and white photograph featuring a man wearing a suit and glasses.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265184/00020166_001_uko5kx.jpg",
    "uuid": "5bcbde0f-ee8e-4ec3-9145-b2990e1704b1",
    "anchor": "1950s-clarkson-oglesby-pioneers-construction-option-in-civil-engineering"
  },
  {
    "body": "William W. Hansen with the 3-foot Mark I electron linear accelerator prototype, 1947. It was built, as all the Mark accelerators were, in the basement of the physics department in the Hansen Experimental Physics Lab (HEPL). Stanford News Service.",
    "year": "1947",
    "heading": "Hansen’s Mark I Accelerator Prototype",
    "alt": "A man wearing a suit and tie is diligently working on a machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265154/hansen_accelerator_ylgrdb.jpg",
    "uuid": "e968e3df-91b7-4a8c-9f6c-848fcd906088",
    "anchor": "1947-hansens-mark-i-accelerator-prototype"
  },
  {
    "body": "First section of the Mark III linear accelerator, 1949. The accelerators were all built on campus at the Hansen  Experimental Physics Lab (HEPL) and were precursors to the 2-mile accelerator later built at SLAC. Stanford News Service.",
    "year": "1949",
    "heading": "Mark III Accelerator: A key step towards SLAC’s 2-mile accelerator",
    "alt": "Two men collaborating on a machine in a factory setting, focused on their task.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265411/linear_accelerator_first_section_pdzh0j.jpg",
    "uuid": "b77aef76-d7d1-478a-a000-8dadd24285f4",
    "anchor": "1949-mark-iii-accelerator-a-key-step-towards-slacs-2-mile-accelerator"
  },
  {
    "body": "Mark III linear accelerator, 1952. This was one of many similarly named accelerators and detectors created and used at the W. W. Hansen Experimental Physics Laboratory (HEPL) and at the Stanford Linear Accelerator (SLAC). Stanford News Service.",
    "year": "1952",
    "heading": "Mark III Accelerator: A key innovation at HEPL and SLAC",
    "alt": "A black and white image of a factory filled with numerous stacked concrete blocks.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265168/mark_iii_linear_accelerator_rcmzad.jpg",
    "uuid": "cfe671cd-31ee-4d4f-8b37-49c8a320a888",
    "anchor": "1952-mark-iii-accelerator-a-key-innovation-at-hepl-and-slac"
  },
  {
    "body": "Electrical engineering faculty  Oswald Garrison Villard Jr. (MEng ’43, PhD ’49), right, and Allen M. Peterson (BS ’48, MS ’49, PhD ’52) with equipment used to record meteors in the ionosphere, August 1950. Their pioneering work on reflecting radar signals off the ionosphere led to Villard’s 1959 debut of “over-thehorizon” radar, which transcended  line-of-sight limitations and laid the foundation for advanced long-range surveillance and missile detection systems. Special Collections & University Archives.",
    "year": "1950",
    "heading": "Recording meteors in the ionosphere",
    "alt": "Two men stand in front of large radio equipment, engaged in conversation and examining the setup closely.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265183/00006955_0005_quv7kg.jpg",
    "uuid": "7beb0470-1337-4557-841e-dbf3d4c25fb4",
    "anchor": "1950-recording-meteors-in-the-ionosphere"
  },
  {
    "body": "Stephen P. Timoshenko teaching a class, 1948. A renowned expert, teacher, and writer widely regarded as the “father” of applied mechanics in the United States, he was born in the Russian Empire in 1878. Timoshenko taught at Stanford from 1936 to 1963 and was instrumental in the formation of the Division of Engineering Mechanics in 1949. Special Collections & University Archives.",
    "year": "1948",
    "heading": "Father of applied mechanics",
    "alt": "A man stands at the front of a classroom, delivering a lecture to attentive students seated at their desks.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265164/PC0141_b07_Timoshenko_0120_ou3zaf.jpg",
    "uuid": "16bc852c-084a-490f-95bc-4c9a9b963c80",
    "anchor": "1948-father-of-applied-mechanics"
  },
  {
    "body": "Edward L. Ginzton with the Mark III linear accelerator, 1951. Ginzton earned his doctorate in electrical engineering at Stanford and was later appointed as a professor of electrical engineering and applied physics. He led a Stanford team that designed the world’s most powerful particle accelerator. Stanford News Service.",
    "year": "1951",
    "heading": "Edward L. Ginzton and the world's most powerful particle accelerator",
    "alt": "A well-dressed man in a suit and tie sits on a machine wiht one hand in their pocket.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265139/ginzton_accelerator_j1ee3v.jpg",
    "uuid": "9ade7046-0e0c-4741-a270-a2b446ff6190",
    "anchor": "1951-edward-l-ginzton-and-the-worlds-most-powerful-particle-accelerator"
  },
  {
    "body": "Professor Edward Ginzton, left, and Dr. Henry Kaplan, a Stanford Medicine radiologist, in front of klystron gauges, circa 1953. Kaplan and Ginzton coinvented North America’s first medical linear accelerator, a 6-million-volt machine constructed at the Stanford Medical Center, then in San Francisco. The Stanford device was first used in 1955, soon after a similar device debuted in England. Stanford News Service.",
    "year": "1953",
    "heading": "The first medical linear accelerator",
    "alt": "Two suited men are positioned next to a wall adorned with numerous buttons.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265164/ginzton_kaplan_bggokw.jpg",
    "uuid": "d4cad0d7-6a6e-4d38-a15d-2c8d949f76b5",
    "anchor": "1953-the-first-medical-linear-accelerator"
  },
  {
    "body": "Left to right: David Packard, William Hewlett, and Dean  of Engineering Fred Terman attend the dedication of the  Hewlett-Packard wing in Stanford’s Electronics Research  Laboratory, 1952. Stanford News Service.",
    "year": "1952",
    "heading": "The dedication of the Hewlett-Packard wing",
    "alt": "Two men shaking hands in front of a building, with a third man observing the interaction nearby.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265413/hewlett-packard_dedication_rm7du9.jpg",
    "uuid": "2c7836ab-b8e3-4bfb-ba97-92cff7f115a9",
    "anchor": "1952-the-dedication-of-the-hewlett-packard-wing"
  },
  {
    "body": "Housed in utilitarian buildings, the Electronics Research Laboratory (ERL) opened in 1951 and provided space for coordinating research operations in electrical engineering. The ERL was soon drawing $700,000 per year in research funding, resulting in expansion plans for an Applied Electronics Laboratory (AEL), approved just months later. Stanford University Planning Office.",
    "year": "1951",
    "heading": "The Electronics Research Laboratory",
    "alt": "An old black and white photo depicting a building in a field surronded by cars.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265199/00006962_0001_opgfxn.jpg",
    "uuid": "c20f48f4-4be5-4195-bb29-bd4a7cbcf13b",
    "anchor": "1951-the-electronics-research-laboratory"
  },
  {
    "body": "Sidebar: Irmgard Flügge-Lotz, \"A Life Which Would Never Be Boring\" Stanford News Service",
    "year": "1960 - This is another sidebar and I wonder again here if instead of including this in the timeline, we should work to incorporate this in Chapter 3.",
    "heading": "First female professor",
    "alt": "A woman stands in front of a blackboard, holding an object resembling a rock in her hand.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265172/flugge-lotz_jieewa.jpg",
    "uuid": "34ad6058-77b3-4921-8114-e875afcce3b0",
    "anchor": "1960 - This is another sidebar and I wonder again here if instead of including this in the timeline, we should work to incorporate this in Chapter 3.-first-female-professor"
  },
  {
    "body": "John G. Herriot, professor of mathematics, when he became the first director of the newly founded Computation Center in 1953. In spring 1955, he taught the first programming course, “Theory and Operation of Computing Machines,” to twenty-five students using an IBM CardProgrammed Calculator, Model II. Computer Science was in the Department of Mathematics until 1985, when it was moved to the School of Engineering. Stanford News Service.",
    "year": "1955",
    "heading": "The first programming course",
    "alt": "A man stands beside a large industrial machine, showcasing its size and complexity in a work environment.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265176/john_g_herriot_fwbols.jpg",
    "uuid": "08d5ac52-d109-4352-8d2e-d4bcac20fe45",
    "anchor": "1955-the-first-programming-course"
  },
  {
    "body": "Joseph Pettit, 1958. A professor of electrical engineering, Pettit served as dean of the School of Engineering from 1958 to 1972. He oversaw a time of growth for the school, during which the school became third in the nation in the number of advanced degrees conferred and the Department of Aeronautics and Astronautics, embracing the Space Age, was founded.  Special Collections & University Archives.",
    "year": "1958-1972",
    "heading": "Stanford Engineering's fourth Dean",
    "alt": "A black and white portrait of a man wearing a suit and tie.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265166/pettit_jn566pd7749_hgribe.jpg",
    "uuid": "d27c9c7b-b689-432b-b535-a486311000bd",
    "anchor": "1958-1972-stanford-engineerings-fourth-dean"
  },
  {
    "body": "Dedication of the Computation Center at Polya Hall, 1963, when computer science was still part of the Department of Mathematics. The IBM 7090 or the Burroughs B5000 may be the machines pictured here. Special Collections & University Archives.",
    "year": "1963",
    "heading": "Polya Hall dedication",
    "alt": "A room filled with several men gathered around a couple of computers, engaged in discussion and collaboration.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265219/computation_corner_dedication_j3dzmf.jpg",
    "uuid": "a798c44b-e555-4a96-af61-a6a5e99b1d7e",
    "anchor": "1963-polya-hall-dedication"
  },
  {
    "body": "Left to right: Stanford electrical engineers John Linvill and James Gibbons, with Gerald Pearson of Bell Labs, March 1958. Gibbons, who would later become dean of the School of Engineering, holds a four-layer Shockley diode, the first semiconductor device ever made at Stanford—and presumably at any university. Gibbons had been taught to build semiconductor devices by William Shockley. Pearson, who had coinvented the solar cell battery while at Bell Labs, joined the Stanford electrical engineering faculty in 1960. Courtesy James Gibbons.",
    "year": "1958",
    "heading": "Four-layer Shockley diode",
    "alt": "Three men in suits gathered around a machine, engaged in discussion and analysis of its functions.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265400/rm634fy8400_m1dxsp.jpg",
    "uuid": "e50fbc79-3b42-4dab-9b39-fb60ceca3f25",
    "anchor": "1958-four-layer-shockley-diode"
  },
  {
    "body": "Ronald Bracewell in 1959, standing in front of the Stanford Radio Astronomy Observatory, which he designed and built. Also known as Heliopolis, the Observatory was made up of thirty-two 10-foot-diameter parabolic antennas arranged in a cross. Together they measured solar activity and the sun’s temperature. The algorithms Bracewell developed to recreate images from scans were later used in computer-assisted tomography (CAT) scans for medical diagnosis. The array was demolished in 2006. Special Collections & University Archives.",
    "year": "1959",
    "heading": "Stanford Radio Astronomy Observatory",
    "alt": " A man poses in front of numerous antennas, outside in a field.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265219/ronald_bracewell_1959_dtua2a.jpg",
    "uuid": "66a002c5-341d-491d-a38c-9371efd597e7",
    "anchor": "1959-stanford-radio-astronomy-observatory"
  },
  {
    "body": "The Stanford “Dish” radio telescope under construction in the Stanford foothills, 1961. A 70-ton, 150-foot steel and aluminum parabolic antenna with a surface spanning nearly half an acre, it was designed and built by the Stanford Research Institute for the U.S. government with support from the U.S. Air Force Office of Aerospace Research and the Defense Support Agency. In the 1940s, a group of Stanford’s electrical engineers––including Robert A. Helliwell, Laurence A. Manning, and O. G. Villard, Jr.—had tested the idea that radio signals bounced off meteor trails. As faculty, they formed the core of Stanford’s Radio Science Laboratory, later joined by professors Ronald Bracewell, Allen M. Peterson, and others. More than a decade later, the Dish enabled vastly expanded studies of scattering effects in the earth’s ionosphere and was used to detect Soviet radar by capturing radio signals that bounced off the moon. The Dish is still used today for satellite calibrations, spacecraft command and telemetry, and radio astronomy measurements.  Stanford News Service.",
    "year": "1961",
    "heading": "The Stanford Dish",
    "alt": "Several men standing together, examining a large structure.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265140/SC0122_s1_b267_f02_0115-01_uc3pdv.jpg",
    "uuid": "4c372ff0-3948-4aac-b1aa-b4929d9c3097",
    "anchor": "1961-the-stanford-dish"
  },
  {
    "body": "Joshua Lederberg, Nobel laureate and chair of genetics, and Elliott Levinthal, professor of mechanical engineering, developed this device to test for life on distant planets. Although it was not included in the first Mars lander mission planned for 1966, in 1975 a modified version flew in the Viking Lander. Special Collections & University Archives.",
    "year": "1963",
    "heading": "The multivator",
    "alt": "Two photographs featuring a mechanical device and a small object.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265216/multivators_qdggyv.jpg",
    "uuid": "c679fa02-6153-4ef3-98c1-075d9d279198",
    "anchor": "1963-the-multivator"
  },
  {
    "body": "John Linvill, left, and his daughter Candace demonstrating the Optacon, 1964. This portable device had a small handheld camera that could be moved across any printed material to generate images on a fingertipsized tactile display, allowing blind people to read printed text. After joining the Stanford faculty in 1955, Linvill founded the school’s Solid State Laboratory. Stanford News Service.",
    "year": "1964",
    "heading": "The Optacon",
    "alt": "A man and woman collaborating at a table.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265407/linvill_daughter_candance_qic2j4.jpg",
    "uuid": "bf5cfe80-eddc-4485-be62-964cd8f322b2",
    "anchor": "1964-the-optacon"
  },
  {
    "body": "Engineering faculty at the groundbreaking for Crothers Memorial Hall dormitory, which  would house engineering graduate students, 1954. Special Collections & University Archives.",
    "year": "1954",
    "heading": "Crothers Memorial Hall dormitory",
    "alt": "A diverse group of individuals gathered in front of a building, smiling and engaging with one another.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265207/00005705_0023_hf0ufd.jpg",
    "uuid": "53346d08-5b66-4ec4-bf8b-5c932a245e1e",
    "anchor": "1954-crothers-memorial-hall-dormitory"
  },
  {
    "body": "Map of the park, showing the growth  of Varian Associates, Hewlett-Packard,  Fairchild, Xerox, and  other businesses,  August 17, 1962.  Special Collections & University Archives.",
    "year": "1962",
    "heading": "Stanford Industrial Park",
    "alt": "A detailed map of the Stanford Industrial Park highlighting buildings and pathways.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265217/SC0122_1981-087_b01_f005_jzcowg.jpg",
    "uuid": "5e0619f2-9951-483d-89ee-aef8cbcb6577",
    "anchor": "1962-stanford-industrial-park"
  },
  {
    "body": "Joseph Frangini (standing) with students in the Sanitary Engineering Laboratory,  completed in the summer of 1955, which was equipped for chemical tests on water  and sewage. A world-renowned expert on fluid mechanics and water resources,  Frangini joined the Stanford faculty as a professor of civil engineering in 1950. Special Collections & University Archives.",
    "year": "1955",
    "heading": "Sanitary Engineering Laboratory",
    "alt": " A laboratory scene featuring three men.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "f143291f-52d5-4864-aa94-094821bc1f30",
    "anchor": "1955-sanitary-engineering-laboratory"
  },
  {
    "body": "John McCarthy, professor of computer science, playing computer chess, 1966. McCarthy coined the term artificial intelligence and founded the influential Stanford Artificial Intelligence Laboratory. The laboratory produced eighteen recipients of the ACM A. M. Turing Award, considered the Nobel Prize of computer science. Chuck Painter/Stanford News Service.",
    "year": "1966",
    "heading": "Stanford Artificial Intelligence Laboratory",
    "alt": "A man in a suit and tie playing chess while sitting at a computer desk.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265155/john_mccarthy_chess_pqxfgp.jpg",
    "uuid": "be7df546-f0ba-4557-8d82-713775cf2a94",
    "anchor": "1966-stanford-artificial-intelligence-laboratory"
  },
  {
    "body": "Nuclear reactor in Stanford’s Nuclear Technology Laboratory, in the former Harris J. Ryan High-Voltage Laboratory, 1961. The 10-kilowatt teaching reactor was on loan from the Atomic Energy Commission.  Stanford News Service.",
    "year": "1961",
    "heading": "Nuclear Technology Laboratory",
    "alt": "A black and white image depicting several individuals standing around a large machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265231/nuclear_reactor_xgxrqi.jpg",
    "uuid": "82778f01-d8ac-4c10-9ddf-f3df0641a04c",
    "anchor": "1961-nuclear-technology-laboratory"
  },
  {
    "body": "Engineering professor George Leppert (right) and graduate student Gary Vliet take measurements in Stanford’s subcritical nuclear assembly, 1958. The apparatus, which operated like a reactor but could not sustain a chain reaction, was located in Stanford’s Nuclear Technology Laboratory. The nuclear engineering program, led by Professor Leppert, was developed in the Mechanical Engineering Department in 1955. Stanford News Service.",
    "year": "1958",
    "heading": "Stanford's subcritical nuclear assembly",
    "alt": "Two men engaged in hands-on work with a large metal object.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265403/U7477_mvmcyh.jpg",
    "uuid": "71f46148-64bd-49b6-aea1-3df8d5515f6b",
    "anchor": "1958-stanfords-subcritical-nuclear-assembly"
  },
  {
    "body": "Provost Frederick E. Terman (left), former dean of the School of Engineering, and Dean Joseph M. Pettit with Mrs. Thomas F. Peterson, 1963. The Thomas F. Peterson Engineering Laboratory—named in memory of her late husband, whose support made the facility  possible—was dedicated in May 1963. Stanford News Service.",
    "year": "1963",
    "heading": "Dedication of The Thomas F. Peterson Engineering Laboratory",
    "alt": "Three individuals, two men and a woman, stand in front of the Thomas F. Peterson Engineering Laboratory building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265178/SC0122_s1_b268_f06_1546-11_rb5f1b.jpg",
    "uuid": "0fde2f39-2323-400a-96e3-32fd8a8893e7",
    "anchor": "1963-dedication-of-the-thomas-f-peterson-engineering-laboratory"
  },
  {
    "body": "Fred Terman and his family at the dedication of the Frederick Emmons Terman Engineering Laboratory,May 31, 1965. The renovated 16,000-square-foot building across from Engineering Corner—which had been the site of his office when he was chair of Electrical Engineering before World War II—was named in Terman’s honor just days after he had announced his retirement as Stanford vice president and provost. “If I could relive my life I could not do any better than to play the same record over again,” Terman said. Stanford News Service.",
    "year": "1965",
    "heading": "Dedication of the Frederick Emmons Terman Engineering Laboratory",
    "alt": "Several people standing together in front of the Frederick Emmons Terman Engineering Labratory.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265138/SC0122_s1_b269_f10_3000-09_np7kyh.jpg",
    "uuid": "1927e291-18ec-4fd5-9c89-b65b65676f6f",
    "anchor": "1965-dedication-of-the-frederick-emmons-terman-engineering-laboratory"
  },
  {
    "body": "Opening of the Jack A. McCullough Building, 1965. Left to right: Mr. and Mrs. McCullough, Stanford trustee David Packard, and Stanford President Wallace Sterling. The building originally housed several groups focused on materials research, including the Center for Materials Research, which brought together faculty from engineering, physics, chemistry, and other fields. The center continues to support interdisciplinary materials research taking place in the Geballe Laboratory for Advanced Materials and the Stanford Institute for Materials and Energy Sciences. Stanford News Service.",
    "year": "1965",
    "heading": "Opening of the Jack A. McCullough Building",
    "alt": "Four individuals, including three men and one woman, reveals the sign for the Jack A. McCullough Building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265142/SC0122_s1_b269_f13_3354-11_qbh2ew.jpg",
    "uuid": "226528e6-f477-4a7f-8ebe-92264e93ad73",
    "anchor": "1965-opening-of-the-jack-a-mccullough-building"
  },
  {
    "body": "Left to right: Michel Boudart, David Mason, John Lind, Douglass Wilde, Robert Madix, George Homsy, Channing Robertson, and Andreas Acrivos attend a Chemical Engineering faculty meeting, 1972. The department became part of the School of Engineering in 1960 but maintained close physical and intellectual ties to the Department of Chemistry. Courtesy Department of Chemical Engineering.",
    "year": "1972",
    "heading": "Chemical Engineering faculty meeting",
    "alt": "Men gathered at a table playing instruments and drinking a beverage.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265198/faculty_meeting_1972_cyq3gl.jpg",
    "uuid": "fdf630e9-897f-44a6-a86e-aa11d9b4c454",
    "anchor": "1972-chemical-engineering-faculty-meeting"
  },
  {
    "body": "The William F. Durand Building for Space Engineering and Science, 1969. The building was built to house the Department of Aeronautics and Astronautics. During this time, the department was receiving more than $1 million in research funding each  year and more than two hundred graduate students enrolled, surpassing MIT as the nation’s largest producer of PhD graduates  in aeronautics and astronautics. Stanford News Service.",
    "year": "1969",
    "heading": "Constrution of the William F. Durand Building for Space Engineering and Science",
    "alt": "An old black and white image featuring individuals cycling and walking around.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265179/00005967_0003_krk8lw.jpg",
    "uuid": "c893fe71-32af-4d37-8734-b4787d3cba20",
    "anchor": "1969-constrution-of-the-william-f-durand-building-for-space-engineering-and-science"
  },
  {
    "body": "Campus facilities had been expanded, remodeled, and reconstructed almost continuously since the university opened its doors for students in 1891. At the time this map was published, some radio science research was conducted elsewhere in California and as far away as Antarctica.\r\nOne major new building, the Space Engineering Building (later named for William F. Durand), was under construction. A summary of the extensive facilities follows (numbers correspond to the buildings shown on the schematic drawing).\r\nSpecial Collections & University Archives.\r\n",
    "year": "1966",
    "heading": "Stanford Engineering facilities map",
    "alt": "Visual representation of the campus layout, featuring essential buildings highlighted in red.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265181/Map_1966_nmlwwh.jpg",
    "uuid": "55070bff-4fac-4183-abbc-b1bf9ebc0c10",
    "anchor": "1966-stanford-engineering-facilities-map"
  },
  {
    "body": "Electrical engineer Owen Garriott on board NASA’s Skylab 3, where he worked the first\r\namateur radio from orbit, 1973. He also performed three spacewalks, logging 14\r\nhours outside of Skylab. In the inaugural class of six scientist-astronauts selected\r\nby NASA in 1965, Garriott went on to fly on board a Space Shuttle mission in 1983,\r\nlogging a lifetime total of 69 days, 18 hours, and 56 minutes off the planet. NASA.\r\n",
    "year": "1973",
    "heading": "First amateur radio from orbit",
    "alt": "A man wearing an astronaut suit sits in a space station.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265406/Owen_Garriott_NASA_pufv2m.jpg",
    "uuid": "ebb6ba7b-e137-4e17-a181-39f57d67d2e7",
    "anchor": "1973-first-amateur-radio-from-orbit"
  },
  {
    "body": "Visitors from France at the Artificial Intelligence Lab on computer music, 1975. Seated from left: Pierre Boulez, Steve Martin; standing from left: Andy Moorer, John Chowning, and Max Mathews. A computational music group founded by Chowning evolved into the Center for Computer Research in Music and Acoustics (CCRMA), which launched in June 1975. Because of the growing reputation of the computer music group at Stanford,Boulez had asked the team to participate in the planning stages of a music research institute being formed at the Centre Pompidou in Paris. Stanford News Service.",
    "year": "1975",
    "heading": "Launch of the Center for Computer Research in Music and Acoustics (CCRMA)",
    "alt": "Several people focused on a computer screen, engaged in discussion and collaboration.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265209/visitors_from_france_e7pbw3.jpg",
    "uuid": "41fb69a7-7f32-417e-800e-c84429056e8a",
    "anchor": "1975-launch-of-the-center-for-computer-research-in-music-and-acoustics-ccrma"
  },
  {
    "body": "Vinton Cerf in front of a blackboard filled with notes on Transmission Control Protocol/Internet Protocol (TCP/IP), circa 1974. TCP/IP, the foundational protocols that underpin the modern Internet, were developed by Cerf in collaboration with Robert Kahn of DARPA. Later, Cerf and Kahn were corecipients of the 2004 A. M. Turing Award for these pioneering contributions. Stanford News Service.",
    "year": "1974",
    "heading": "Transmission Control Protocol (TCP)",
    "alt": "A bearded man stands confidently in front of a chalkboard holding a pipe.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265215/vinton_cerf_ofhvxu.jpg",
    "uuid": "d06d103d-e76f-450e-81d6-007a00bd9225",
    "anchor": "1974-transmission-control-protocol-tcp"
  },
  {
    "body": "Mechanical Engineering student Victor Scheinman with a prototype hydraulic arm, 1969. The arm, now on display inside the Gates Computer Science Building, was one of two that were mounted to a table where researchers and students used it for research and teaching purposes for over twenty years, often focused on applications in the manufacturing industry. In 1974, a version of the Stanford Arm was able to assemble a Ford Model T water pump. The Board of Trustees of the Leland Stanford Junior University.",
    "year": "1969",
    "heading": "Prototype of a hydraulic arm",
    "alt": "A man stands in front of a computer, holding a robotic arm.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265429/3523ScheinmanHydrArm_i9xqlr.jpg",
    "uuid": "51bd48ba-bdd4-43a6-8fc1-4b5f92f1d8f1",
    "anchor": "1969-prototype-of-a-hydraulic-arm"
  },
  {
    "body": "Students demonstrating against the invasion of Laos by the South Vietnamese with U.S. air support,  1971. The students seized the Computation Center during twelve hours of confrontation and violence  to protest the center’s use for war research. There were twelve arrests and no injuries.  Jose Mercado/Stanford News Service.",
    "year": "1971",
    "heading": "Demonstration again the invasion of Laos",
    "alt": "A man stands in front of a computer, holding a robotic arm.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "29a26e1f-0fdb-468d-8602-ea2cb0738ad3",
    "anchor": "1971-demonstration-again-the-invasion-of-laos"
  },
  {
    "body": "Students in the Design Engineering class, 1968 and 1969. In the late 1950s, Stanford Engineering’s Mechanical Engineering Design Division pioneered a new approach to engineering and design education, emphasizing hands-on, experiential learning through environments, including the Design Loft and Machine Shop (today, Product Realization Lab). Under the leadership of faculty John E. Arnold and Robert H. McKim, the Product Design program focused on teaching design as a creative practice, integrating engineering, arts, natural science, social science, and the humanities into a comprehensive design education to address real-world needs. The division aimed to prepare engineers who developed the ability to integrate technical and artistic skills with social and environmental understanding to create innovative solutions for complex challenges. This comprehensive design approach set the foundation for a broader emphasis on interdisciplinary design, which later influenced the emergence of design practices like Smart Product Design and Interaction Design and, eventually, the Hasso Plattner Institute of Design (d.school). Stanford News Service.",
    "year": "1968-1969",
    "heading": "Mechanical Engineering Design Division",
    "alt": "A group of people looking at an object displayed on top of stairs.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265165/SC0122_s1_b271_f05_6030-09_c8jpbq.jpg",
    "uuid": "8cc7921d-0ae5-40d4-8ab7-e854deb9f039",
    "anchor": "1968-1969-mechanical-engineering-design-division"
  },
  {
    "body": "The control room for the Stanford Instructional Television Network (SITN), showing James Angell lecturing, 1969. This network allowed employees of member companies within a 50-mile range of Hoover Tower to take classes offered by the School of Engineering as part of the Honors Cooperative Program (HCP). When the HCP was founded in 1954, students had to come to campus to attend classes. With the founding of the SITN in 1969, students could begin attending the program remotely. The network eventually became part of the Stanford Center for Professional Development. Special Collections & University Archives.",
    "year": "1969",
    "heading": "Stanford Instructional Television Network (SITN)",
    "alt": "A black and white image of a man surrounded by multiple monitors in a dimly lit room with onlookers in front of him.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265159/SC0122_s1_b278_f04_C388-13_pyqfce.jpg",
    "uuid": "ada8fbd3-d2d0-481f-a3ac-ec96eeb0c3a5",
    "anchor": "1969-stanford-instructional-television-network-sitn"
  },
  {
    "body": "Barbara Liskov, the first woman to receive a PhD  in computer science from Stanford University, 1968.  She was also among the first women to receive a PhD from a computer science department in the United States. For her PhD, Liskov worked with John McCarthy, focusing on chess endgames. In 2008, she became the second woman to receive the A. M. Turing Award.  Kenneth C. Zirkel/Wikimedia Commons.",
    "year": "1968",
    "heading": "First woman to receive a PhD in computer science from Stanford University",
    "alt": "A woman with curly hair smiles warmly at the camera.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265430/Barbara_Liskov_computer_scientist_2010_bzar2y.jpg",
    "uuid": "7aa9f9f9-bda7-4453-986d-7918a3a0d3e1",
    "anchor": "1968-first-woman-to-receive-a-phd-in-computer-science-from-stanford-university"
  },
  {
    "body": "William M. Kays, May 1971. Kays began his career  at Stanford as an undergraduate in engineering (’42), earned his MS (’47) and PhD (’51) in mechanical engineering, and went on to join the faculty in that department. By 1961, he was department chairman and in 1972 was appointed dean of the School of Engineering, in which role he served until 1984. Under Kays’s leadership, all of Stanford’s engineering departments ranked in the top five in their graduate fields nationally. The school increased its external funding of research and expanded the number of students, particularly women. The Center for Integrated Systems and the John A. Blume Earthquake Engineering Center were both established during his tenure. Jose Mercado/Stanford News Service.",
    "year": "1972",
    "heading": "Stanford's fifth Dean, William M. Kays",
    "alt": "A black and white portrait of a man wearing glasses.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265145/00019306_001_csiwis.jpg",
    "uuid": "72070450-a305-4f54-8611-d0c4d8b73639",
    "anchor": "1972-stanfords-fifth-dean-william-m-kays"
  },
  {
    "body": "Clayton Bates, professor of materials science and engineering and of electrical engineering, 1974. In 1972, following a ten-year career in industry, Bates became the first Black faculty member to hold a tenure-track appointment in the School of Engineering. Along with a group of graduate students, Bates founded the Stanford Society of Black Scientists and Engineers, an affiliate chapter of the National Society of Black Engineers. He also acted as a mentor and supporter of Black students in the areas of science, technology, engineering, and mathematics (STEM) and advocated for equity in STEM education. His expertise was in solid-state physics, and he was particularly interested in photoelectronic materials and devices. His work focused on the unraveling of processes involved in the interaction of photons and electrons with the very complex materials used in photoelectronic sensing devices. Stanford News Service.",
    "year": "1972",
    "heading": "First black faculty member to hold a tenure-track appointment",
    "alt": "A black and white portrait of a man wearing glasses.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265152/SC0122_s1_b278_f01_C076-02_qvsla2.jpg",
    "uuid": "fbc00c2b-abe2-4b7b-92d2-9da8f4ccd244",
    "anchor": "1972-first-black-faculty-member-to-hold-a-tenure-track-appointment"
  },
  {
    "body": "Kenneth Arrow, professor of operations research, at his press conference after winning the Nobel Prize in 1972. Arrow was on the faculty at Harvard University when he won the Nobel Prize for work he did while at Stanford for “pioneering contributions to general economic equilibrium theory and welfare theory.” Arrow returned to Stanford in 1979 and stayed until his retirement in 1991. Chuck Painter/Stanford News Service.",
    "year": "1972",
    "heading": "Kenneth Arrow wins the Nobel Prize",
    "alt": "A man in a suit and tie stands confidently as reporters gather around him, capturing the moment with their cameras.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265227/kenneth_arrow_wexcgd.jpg",
    "uuid": "28bbcbf3-ff46-49e8-9b18-d678ac1bd3dc",
    "anchor": "1972-kenneth-arrow-wins-the-nobel-prize"
  },
  {
    "body": "Engineering Corner, 1974. The new shield design for the School of Engineering, introduced in 1967, was added to the building in the early 1970s, before the school moved into its new home in the Terman Engineering Building in 1977. The mascle (diamond with the center removed) framework is orange, engineering’s academic color, on a blue background, denoting Stanford Engineering’s commitment to graduate education. The triple redwood fronds, found on all Stanford University heraldry, symbolize, first, “the organization, transmission, and generation of knowledge which takes place in the School and on which the scholarly growth of engineering depends,” and, second, “the tripartite character of Stanford’s School of Engineering—students, faculty, and alumni.” Special Collections & University Archives.",
    "year": "1974",
    "heading": "Engineering corner displays the school's new shield design",
    "alt": "An old black and white image featuring individuals cycling and walking around.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265179/00005967_0003_krk8lw.jpg",
    "uuid": "fde88d5d-8a8b-43da-b687-4c2838a09d61",
    "anchor": "1974-engineering-corner-displays-the-schools-new-shield-design"
  },
  {
    "body": "Haresh Shah, codirector of the John A. Blume Earthquake Engineering Center (left), shows John Blume one of thecenter’s testing machines. Since its founding, with help from a generous endowment from Blume, the Blume Center has functioned as the umbrella for all earthquake engineering activities at Stanford University. Stanford News Service.",
    "year": "1975",
    "heading": "Dedication of the John A. Blume Earthquake Engineering Center",
    "alt": "Image of several people, with two men engaged in a discussion.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265156/SC0122_s1_b278_f10_C958-007_lqdmba.jpg",
    "uuid": "6a25eb1a-d79f-4d77-ad07-be03ac789851",
    "anchor": "1975-dedication-of-the-john-a-blume-earthquake-engineering-center"
  },
  {
    "body": "Haresh Shah (left) and James Gere,1974. Shah and Gere served as codirectors of the Blume Earthquake Engineering Center from 1974 to 1985. Stanford News Service.",
    "year": "1974",
    "heading": "Blume Earthquake Engineering Center leaders",
    "alt": "Two men in a laboratory working together on a complex machine.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265138/SC0122_s1_b278_f09_C832-06_wlr8rl.jpg",
    "uuid": "11883fbe-7dd1-43ee-89bd-155492135f5b",
    "anchor": "1974-blume-earthquake-engineering-center-leaders"
  },
  {
    "body": "Engineering students with Professor Haresh Shah (right), May 1972. Stanford Engineering undertook a concerted effort to recruit women starting in the early 1970s. By 1979, a quarter of all engineering undergraduates were women, and engineering had become the number-one field of choice for women at Stanford. Stanford News Service.",
    "year": "1972",
    "heading": "Women in engineering",
    "alt": "Two woman and a man reviewing documents together in a classroom setting.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265156/students_with_professor_shah_s8vayt.jpg",
    "uuid": "99bd3fe6-bb0e-4e84-9f10-025142abfc14",
    "anchor": "1972-women-in-engineering"
  },
  {
    "body": "Martin Hellman, 1978. Hellman earned graduate degrees in electrical engineering at Stanford (MS ’67, PhD ’69), and returned to join the faculty in 1971. He became professor emeritus in 1996. Chuck Painter/Stanford News Service.",
    "year": "1978",
    "heading": "Martin Hellman: Stanford Graduate and Influential Faculty Member in Electrical Engineering",
    "alt": "A bearded man in a shirt sits in front of books.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265405/martin_hellman_1978_n6m3s5.jpg",
    "uuid": "49ef690c-f697-4901-996e-46ac9826ad95",
    "anchor": "1978-martin-hellman-stanford-graduate-and-influential-faculty-member-in-electrical-engineering"
  },
  {
    "body": "Admiral Bobby Ray Inman, 1983. Inman became director of the NSA in 1977 and served for four years. In 1981 he became deputy director of the Central Intelligence Agency, retiring in 1982. CIA/Wikimedia Commons.",
    "year": "1983",
    "heading": "Admiral Bobby Ray Inman: Key Leadership Roles at NSA and CIA in the Late 20th Century",
    "alt": "A man in uniform seated in front of an American flag.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265424/1024px-Admiral_Bobby_Ray_Inman__official_CIA_photo__1983_sha4yp.jpg",
    "uuid": "663772aa-0f44-4cbf-8c8c-83d2d4af0d1b",
    "anchor": "1983-admiral-bobby-ray-inman-key-leadership-roles-at-nsa-and-cia-in-the-late-20th-century"
  },
  {
    "body": "LEFT TO RIGHT: Ralph Merkle (U.C. Berkeley), Martin Hellman (Electrical Engineering), and Whitfield Diffie (EE graduate student and collaborator with Hellman),1977. In 1976 Hellman and Diffie published the first public-key data encryption technology, a discovery that is viewed as the birth of modern cryptography. Hellman and Diffie won the 2015 A.M. Turing Award for this work. Chuck Painter/Stanford News Service.",
    "year": "1977",
    "heading": "First public-key data encryption technology",
    "alt": "Three men examining a large paper document.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265167/merkle_hellman_diffie_r007vv.jpg",
    "uuid": "e31c3450-0d87-4bf1-b9a2-529e8fb05f88",
    "anchor": "1977-first-public-key-data-encryption-technology"
  },
  {
    "body": "Fred Terman at the Terman Engineering Building, 1977. The building was supported by gifts from Terman’s former students William Hewlett and David Packard. In 2012, the building was dismantled and its materials used in other construction projects. A shallow rectangular fountain now marks its former location. Chuck Painter/Stanford News Service.",
    "year": "1977",
    "heading": "The Terman Engineering Building",
    "alt": "A man stands on a balcony, looking out at a building, contemplating the scene before him.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265179/fred_terman_1977_k6fsc1.jpg",
    "uuid": "65cee591-616a-4c46-bebe-831b383da909",
    "anchor": "1977-the-terman-engineering-building"
  },
  {
    "body": "The cart, first developed in 1961, was updated in 1979 with a camera on a mechanical swivel to make it fully autonomous. It rolled at a consistent walking pace, following a white line. This tracking system worked sometimes, but inconsistencies in lighting, visual interference from other objects, or an abrupt curve could all throw the cart off course. In 1979, the cart successfully made its way 20 meters through a chair-strewn room in five hours without human intervention. The Board of Trustees of the Leland Stanford Junior University.",
    "year": "1977",
    "heading": "Stanford Cart",
    "alt": "Black and white photo featuring a bicycle with a camera mounted on it.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265208/SC1041_SAIL_CartDeck_2_gao7tp.jpg",
    "uuid": "5f4c1fc5-7ee5-4670-a8fd-d728e9612bd7",
    "anchor": "1977-stanford-cart"
  },
  {
    "body": "LEFT TO RIGHT: Stanford computer scientists John Shott, John Hennessy, and James D. Meindl. Hennessy established the microprocessor without interlocked pipeline stages (MIPS) project to develop computers with simpler instruction sets that could be completed in less time. This group developed the reduced instruction set computer (RISC) architecture, for which Hennessy and U.C. Berkeley collaborator David Patterson won the 2017 Turing Award. Today, virtually all tablets, phones, and smart devices run on RISC architectures. Chuck Painter/Stanford News Service.",
    "year": "1981",
    "heading": "Microprocessor without Interlocked Pipeline Stages (MIPS)",
    "alt": "Three men collaborating around a large document, engaged in discussion.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265162/jh189cy1846_bzmmv6.jpg",
    "uuid": "46a9e04d-4a73-4f92-b86c-8f94671f25e6",
    "anchor": "1981-microprocessor-without-interlocked-pipeline-stages-mips"
  },
  {
    "body": "French President François Mitterrand visits the Center for Integrated Systems (CIS) to learn about the emerging economic powerhouse called Silicon Valley, 1984. As a collaboration between Stanford and industry,CIS allowed faculty and graduate students from engineering, computer science, and applied physics to work on projects of interest to the microelectronics and computer science industries. From left to right: mainframe pioneer Gene Amdahl, Professor John Linvill, Intel cofounder Robert Noyce, Mitterrand, Vice Provost Gerald Lieberman, Professor James Meindl, Apple founder Steve Jobs, Nobel Laureate and Professor Paul Berg, Genentech Chairman Thomas Perkins, Hewlett-Packard President John Young, venture capitalist (and future Stanford trustee) Burton McMurtry, and Professor Edward Feigenbaum. Special Collections & University Archives.",
    "year": "1984",
    "heading": "Center for Integrated Systems (CIS)",
    "alt": "A group of men in suits standing together outside.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265169/meindl_mitterand_jobs_u3vm9p.jpg",
    "uuid": "ea94d051-7e44-45ad-a454-091a754dafe3",
    "anchor": "1984-center-for-integrated-systems-cis"
  },
  {
    "body": "James Gibbons, 1984, near the start of his twelve years as dean of the Stanford School of Engineering. During his tenure, the Department of Computer Science moved into the School of Engineering, and the school launched a new computer science major, video instruction, and distance learning, which extended the reach of the school globally. Gibbons’s ties to industry led him to strengthen partnerships with Silicon Valley. School of Engineering.",
    "year": "1984",
    "heading": "Stanford Engineering's sixth Dean",
    "alt": "A black and white photo featuring a man dressed in a formal suit and tie.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265425/james_gibbons_1984_d9vof3.jpg",
    "uuid": "f1e240eb-899e-4285-bf65-68904a7dbd2b",
    "anchor": "1984-stanford-engineerings-sixth-dean"
  },
  {
    "body": "An excerpt from The Stanford Daily, vol. 195, no. 64, 1989 | Linda A. Cicero/Stanford News Service.",
    "year": "1989",
    "heading": "Solar car project to follow sun to national race",
    "alt": "A solar-powered vehicle stands parked outside a building with a person riding a bike in the background.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265165/stanford_solar_car_hf0620.jpg",
    "uuid": "129290ca-d235-4cb4-bc5c-97b5845402a6",
    "anchor": "1989-solar-car-project-to-follow-sun-to-national-race"
  },
  {
    "body": "Students using computer terminals, 1985. Special Collections & University Archives.",
    "year": "1985",
    "heading": "Digitizing Education: Students Engage with Computer Terminals",
    "alt": "A diverse group of individuals focused on their computers while seated at tables.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265422/SC0122_1998-144_b02_Computers_1985_0030_ma4z7u.jpg",
    "uuid": "075d2f9f-3e9e-456a-b4ab-327f6c18f828",
    "anchor": "1985-digitizing-education-students-engage-with-computer-terminals"
  },
  {
    "body": "Redevelopment of the science and engineering buildings. The “Near West Campus” project, as it was known for its location relative to the main quad, involved removing five structures, remodeling two, and building four new structures, and was Stanford’s largest construction project ever. The project kicked off in 1986 with a gift from William Hewlett. In 1994, another gift from Hewlett and business partner David Packard provided funds to complete the project, which opened its doors in 1999. Stanford University Planning Office.",
    "year": "1986-1999",
    "heading": "\"Near West Campus\" redevelopment",
    "alt": "A construction site featuring machinery and workers, with a building visible in the background.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265201/PC0062_2008-194_SEQ_04_015_ziycgm.jpg",
    "uuid": "c0cf21bb-e444-433e-9efe-be2c08386e86",
    "anchor": "1986-1999-near-west-campus-redevelopment"
  },
  {
    "body": "Aerial view of the Stanford campus showing construction of the Near West Campus project, 1994. Stanford University Planning Office.",
    "year": "1994",
    "heading": "Aerial View of Stanford's Near West Campus",
    "alt": "Aerial view of Stanford University's campus showcasing its iconic architecture and lush green spaces.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265177/PC0062_2008-194_AERIALS_01_009_wsktco.jpg",
    "uuid": "8ed8fd7c-6d4d-47ee-b0a3-305193625d3f",
    "anchor": "1994-aerial-view-of-stanfords-near-west-campus"
  },
  {
    "body": "Andy DiPaolo, director of the Stanford Instructional Television Network (SITN), 1994. The SITN was one of the largest distance education networks in the United States, delivering graduate degree programs, credit courses, certificate programs, and professional education to students in Silicon Valley and around the world. Although it had been offering courses to local professionals for more than a decade, SITN became available to students in 1987. It was later incorporated into the Stanford Center for Professional Development, which was founded under DiPaolo’s leadership in 1995. Stanford Engineering Global and Online Education.",
    "year": "1994",
    "heading": "The Stanford Instructional Television Network (SITN)",
    "alt": " A man in a blue shirt stands confidently in front of tall and elegant pillars.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265161/P8025899_w4032_q10_tamdi6.jpg",
    "uuid": "d6352a59-2b83-4043-9545-dcb882124c7f",
    "anchor": "1994-the-stanford-instructional-television-network-sitn"
  },
  {
    "body": "Astronaut Mae Jemison, who graduated from Stanford University in 1977, was the keynote speaker at the university’s 105th commencement in 1996. In her 1996 commencement speech, Mae C. Jemison (BS ’77 chemical engineering), challenged outgoing graduates to embrace personal and professional change and engage different perspectives to create new solutions: “We each get a chance to choose our own path. . . . Sometimes, it seems to me that we are running away from problems and reacting to issues in our world and our societies as though we are afraid of change, that we’re afraid of things being a little bit different. And that’s keeping us from formulating the right question so we can solve a problem.”18 Linda A. Cicero/Stanford News Service.",
    "year": "1996",
    "heading": "105th commencement keynote speaker",
    "alt": "A smiling woman in a graduation gown stands confidently at the podium.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265424/mae_jamison_commencement_bvmth7.jpg",
    "uuid": "00c24ca8-ee61-4a19-ba93-8b10366b0aae",
    "anchor": "1996-105th-commencement-keynote-speaker"
  },
  {
    "body": "STS-47 Mission Specialist Mae C. Jemison floating in the Science Module aboard the Space Shuttle Endeavour, September 1992. NASA.",
    "year": "1992",
    "heading": "America's first female African American astronaut",
    "alt": "A woman in a space suit floats in the vastness of space.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265210/STS047-37-003_large_rk5g83.jpg",
    "uuid": "11af5c9e-99a9-4943-8601-d92c032849e9",
    "anchor": "1992-americas-first-female-african-american-astronaut"
  },
  {
    "body": "Ellen Ochoa, who earned a master’s and doctorate in electrical engineering from Stanford, became the first Hispanic woman to go into space in 1993. She flew into space four times on Space Shuttle missions STS-56, STS-66, STS-96, and STS-110, logging nearly 1,000 hours in orbit. She went on to become the eleventh director of the Lyndon B. Johnson Space Center. NASA.",
    "year": "1993",
    "heading": "First Hispanic woman to go into space",
    "alt": "A woman wearing a space suit poses before an American flag.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265229/IA_35_EllenOchoa_NASAviaFlickr_29320023973_856ebf4a77_o-1_qftsts.webp",
    "uuid": "32bf9e16-724a-409f-8b5c-9cb814a116a5",
    "anchor": "1993-first-hispanic-woman-to-go-into-space"
  },
  {
    "body": "Jeannie Marie Flynn Leavitt, who entered the Air Force in 1992 after earning her master’s degree in aeronautics and astronautics from Stanford University, 1993. Leavitt became the first woman entered into the Air Force fighter pilot training program and the U.S. Air Force’s first female fighter pilot in 1993, graduating first in her class. She was also the first woman to command a USAF combat fighter wing. U.S. Air Force.",
    "year": "1993",
    "heading": "First woman to command a USAF combat fighter wing",
    "alt": "A woman in a flight suit, touching a piece of the plane.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265215/DF-SC-97-01109_zpm0cf.jpg",
    "uuid": "72224d78-7aca-4dcc-910b-b873b4d17e26",
    "anchor": "1993-first-woman-to-command-a-usaf-combat-fighter-wing"
  },
  {
    "body": "Damage to a library following the Loma Prieta earthquake in 1989. More than 750,000 books were salvaged at campus libraries following the quake. The west wing of Green Library was the hardest hit. David C. Weber/Special Collections & University Archives.",
    "year": "1989",
    "heading": "Loma Prieta Earthquake: Stanford Library suffers heavy damage",
    "alt": "A black and white photo of a library featuring fallen bookshelves and books scattered on the floor.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265225/fn928pv3867_voo2ky.jpg",
    "uuid": "2f8fe675-88b6-4cf5-a358-20a37e928342",
    "anchor": "1989-loma-prieta-earthquake-stanford-library-suffers-heavy-damage"
  },
  {
    "body": "Damage to Encina Hall from the Loma Prieta earthquake, 1989. Faculty from the John A. Blume Earthquake Engineering Center led teams that inspected all campus buildings after the quake hit on October 17. Altogether, more than two hundred buildings sustained damage, some beyond repair. Building restoration took more than a decade to complete and cost nearly $160 million. Special Collections & University Archives.",
    "year": "1989",
    "heading": "Loma Prieta Earthquake damages Stanford’s Encina Hall",
    "alt": "Black and white image of a building featuring a broken roof, where fragments have fallen onto a different part of the structure.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265187/00006854_0002_rp3ytt.jpg",
    "uuid": "a135b085-69c8-484b-9b37-04b796ba9ef5",
    "anchor": "1989-loma-prieta-earthquake-damages-stanfords-encina-hall"
  },
  {
    "body": "Edward Feigenbaum, corecipient with Dabbala Rajagopal “Raj” Reddy of the 1994 Turing Award for their work in artificial intelligence, 1966. At the suggestion of Nobel Prize–winner Joshua Lederberg, Feigenbaum developed a way to predict the structure of chemical compounds. He went on to develop programs in other areas of molecular biology, medicine, and defense, among other fields. School of Engineering.",
    "year": "1994",
    "heading": "Turing Award for work in artificial intelligence",
    "alt": "A man in a suit jacket and glasses.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265197/fs075wb6787_i8hbd2.jpg",
    "uuid": "1d9b32b0-5b10-4660-a3bb-d59c350b9113",
    "anchor": "1994-turing-award-for-work-in-artificial-intelligence"
  },
  {
    "body": "Electrical engineering graduate students and Yahoo! founders David Filo (left) and Jerry Yang, 1994. They created a website that served as a directory of the nascent World Wide Web. By autumn 1994, the site, run by servers in a campus trailer, handled a million hits a day. The following year, venture funding helped launch Yahoo! into a major Internet company. School of Engineering.",
    "year": "1994",
    "heading": "Emergence of the World Wide Web",
    "alt": "Two men pose together in front of a Yahoo logo and website screenshots.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265187/jx362js8604_blagdq.jpg",
    "uuid": "1f9c097b-9c2c-4f29-b8f9-688d5e1e3f3f",
    "anchor": "1994-emergence-of-the-world-wide-web"
  },
  {
    "body": "Exterior view of the William Hewlett Teaching Center, 2000. It was one of four new buildings constructed as part of the Near West Campus project, which opened in 1999. Funded primarily by William Hewlett and David Packard, it houses educational resources, including auditoriums and lecture halls. Linda A. Cicero/Stanford News Service.",
    "year": "2000",
    "heading": "William Hewlett Teaching Center",
    "alt": "A large white building stands prominently beside another structure as two men walk by.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265404/hewlett_center_exterior_aeutsi.jpg",
    "uuid": "864cf601-beb5-4f9a-a835-c134acbe7a57",
    "anchor": "2000-william-hewlett-teaching-center"
  },
  {
    "body": "Oussama Khatib, then associate professor of computer science, demonstrating his human-like robots, 1996. Dubbed Romeo and Juliet, the robots were designed and built to provide humans with semiautonomous assistance. They could perform tasks such as washing windows, picking books off shelves, erasing whiteboards, and dusting furniture. Linda A. Cicero/Stanford News Service.",
    "year": "1996",
    "heading": "Romeo and Juliet, human-like robots",
    "alt": "A man poses in a chair sitting next to a robot dusting the table, while three individuals work in the background.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265416/oussama_khatib_dpohpx.jpg",
    "uuid": "4917de34-7ec8-407b-86d4-bd50587b888a",
    "anchor": "1996-romeo-and-juliet-human-like-robots"
  },
  {
    "body": "Stanford President John Hennessy, alumni Sergey Brin and Larry Page, and computer science professor Donald Knuth at a gathering on campus to celebrate Google, April 2005. School of Engineering.",
    "year": "2005",
    "heading": "Sergey Brin and Larry Page collaborate",
    "alt": "A group of men standing together posing for a photo.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265412/pk304kr0557_EWS_k7kxcv.jpg",
    "uuid": "445d66c8-88eb-4d37-829a-5110f093c9e0",
    "anchor": "2005-sergey-brin-and-larry-page-collaborate"
  },
  {
    "body": "A robot demonstration at the dedication of the William Gates Computer Science Building, 1996. Attendees included (from left in front row) Stanford President Gerhard Casper, professor of computer science Oussama Khatib, William Hewlett (seated), Bill and Melinda Gates, and David Packard (seated). In addition to facilities that support research and education, the building houses exhibits containing historical equipment and documents focusing on Stanford’s role in the history of computing. Linda A. Cicero/Stanford News Service.",
    "year": "1996",
    "heading": "Dedication of the William Gates Computer Science Building",
    "alt": "A group of people gathered around a robot.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265137/robot_demonstration_cpg8nr.jpg",
    "uuid": "85971513-7396-46e9-a294-c591d56a4647",
    "anchor": "1996-dedication-of-the-william-gates-computer-science-building"
  },
  {
    "body": "Exterior view of the William Gates Computer Science Building, 2022. When it was completed in 1996, the building housed facilities for research and education and united the previously dispersed Computer Science Department. Linda A. Cicero/Stanford News Service.",
    "year": "2022",
    "heading": "Bridging innovation: A look at the William Gates Computer Science Building, unifying Stanford’s Computer Science Department since 1996",
    "alt": "A person riding a scooter in front of a building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265140/A-CAM-2022SE-178_bh3zwv.jpg",
    "uuid": "14203f43-f1ab-4321-9293-d9201fbb7a5a",
    "anchor": "2022-bridging-innovation-a-look-at-the-william-gates-computer-science-building-unifying-stanfords-computer-science-department-since-1996"
  },
  {
    "body": "John Hennessy, Bill Gates, and Jim Gibbons outside the William Gates Computer Science Building during its dedication, 1996. Hennessy was dean of the school at this time, Gates was the major donor for the building, and Gibbons, former dean, was serving as special counsel to the president and provost on industry relations. Linda A. Cicero/Stanford News Service.",
    "year": "1996",
    "heading": "Dedication of the William Gates Computer Science Building",
    "alt": "Three men in formal suits standing together outside the William Gates Computer Science building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265185/xx798bb1141_zbiqrv.jpg",
    "uuid": "0cc694fc-37e6-4c09-97c4-add1c1493933",
    "anchor": "1996-dedication-of-the-william-gates-computer-science-building"
  },
  {
    "body": "John Hennessy, dean of the School of Engineering from 1996 to 1999. During Hennessy’s tenure, the school launched an online master’s degree in electrical engineering—the first fully online degree to be offered by the university. He also encouraged more multidisciplinary and interdisciplinary activities at the school while maintaining a first-rate academic profile, and oversaw a five-year plan that emphasized bioengineering and biomedical engineering. Linda A. Cicero/Stanford News Service.",
    "year": "1996-1999",
    "heading": "Stanford Engineering's seventh Dean",
    "alt": "A man in a suit and tie smiles confidently at the camera.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265223/john_hennessy_giilx7.jpg",
    "uuid": "49ff563d-b641-4d24-a514-2777d642117f",
    "anchor": "1996-1999-stanford-engineerings-seventh-dean"
  },
  {
    "body": "James Plummer, dean of the School of Engineering from 1999 to 2014, at a Stanford commencement, 2005. As the longest-serving dean in the school’s history, Plummer led the school through a major expansion and greatly increased the number of students majoring in engineering. He also advocated for all engineering students to take advantage of liberal arts opportunities at Stanford. Linda A. Cicero/Stanford News Service.",
    "year": "2005",
    "heading": "Stanford Engineering's eigth Dean",
    "alt": "A smiling man in a graduation gown stands at the podium.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265227/james_plummer_n9oena.jpg",
    "uuid": "97d34d71-398a-4a0e-aa6e-f79392f1b753",
    "anchor": "2005-stanford-engineerings-eigth-dean"
  },
  {
    "body": "Elisabeth Paté-Cornell, 1992. She became the first female department chair in the school when she became chair of the Department of Industrial Engineering and Engineering Management in 1997. In 1999 she was appointed to the Burt and Deedee McMurtry Professorship, becoming the first woman in Stanford Engineering history to hold an endowed chair. At the time, she was one of only five tenured women on the school’s faculty. Stanford News Service.",
    "year": "1992",
    "heading": "First female department chair",
    "alt": "A woman sits before a wall of bookshelves, holding a piece of paper and smiling.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265409/SC0122_1992-003_b303_X269-007_twv1p4.jpg",
    "uuid": "5e849548-de5f-4ab3-8a8b-3e0e74b5a5a1",
    "anchor": "1992-first-female-department-chair"
  },
  {
    "body": "OVERLEAF: Exterior view of the David Packard Electrical Engineering Building, 2022. The Packard building was one of four new buildings constructed as part of the first phase of the Near West Campus project. The building became a home for the Electrical Engineering Department. A major renovation of the basement level was undertaken in 2023 to create the new Stanford Robotics Lab, which opened in 2024, along with several new makerspaces. Linda A. Cicero/Stanford News Service.",
    "year": "2022",
    "heading": "Evolution of the David Packard Electrical Engineering Building",
    "alt": "A view of the David Packard Electrical Engineering building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265162/A-CAM-2022SE-138_bcjho9.jpg",
    "uuid": "c8ec7ff5-85d5-43e9-b081-564be2837b07",
    "anchor": "2022-evolution-of-the-david-packard-electrical-engineering-building"
  },
  {
    "body": "From left: Terry Winograd, Héctor García-Molina, David Cheriton, Larry Page, Rajeev Motwani, and Sergey Brin at a gathering on campus to celebrate Google, 2005. School of Engineering.",
    "year": "2005",
    "heading": "Silicon Valley icons unite: Celebrating Google’s success with Stanford legends in 2005",
    "alt": "A group of men gathered together and posing for a photo.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265414/google_gathering_2005_lvouaq.jpg",
    "uuid": "29282bdd-6f83-44a3-b52f-200713db3159",
    "anchor": "2005-silicon-valley-icons-unite-celebrating-googles-success-with-stanford-legends-in-2005"
  },
  {
    "body": "The original server running the Google algorithm developed by engineering graduate students Larry Page and Sergey Brin, made up of ten 4-gigabyte disk drives, encased in toy building blocks, translucent plastic, and packing tape, 1996. This combined 40 GB of storage was considerably larger than what was required of most student projects at the time. It is now on display in the Jen-Hsun Huang Engineering Center. Linda A. Cicero/Stanford News Service.",
    "year": "1996",
    "heading": "The original Google server",
    "alt": "A server encased in colorful toy building blocks, located in the Jen-Hsun Huang Engineering Center.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265136/original_Google_server_lbqfqy.jpg",
    "uuid": "1bf4b62b-3a3f-4625-a860-defbc097cfa4",
    "anchor": "1996-the-original-google-server"
  },
  {
    "body": "Dave Murray (right), a cryogenic engineer from Lockheed Martin, and Mike Taber, Stanford’s cryogenic test director, inspecting the flight dewar for the Gravity Probe B spacecraft when it was under construction, 1996. The dewar acted like a giant thermos bottle to keep the spacecraft’s instruments cool. Gravity Probe B was a long-standing Stanford experiment to test Einstein’s general theory of relativity. A report of the experiment published in 2007 declared success: “The 17.3-month flight mission succeeded in collecting all the data needed to carry out this unprecedented, direct experimental test of Einstein’s general theory of relativity—his theory of gravity.” Gravity Probe B.",
    "year": "1996",
    "heading": "Cooling down the cosmos: Engineers behind the successful test of Einstein's gravity with Gravity Probe B",
    "alt": "A man inspects a large metal object, accompanied by another man who watches nearby.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265417/murray_and_taber_ibiiju.jpg",
    "uuid": "1ab98c24-3897-4b21-b856-b13bc9871ae7",
    "anchor": "1996-cooling-down-the-cosmos-engineers-behind-the-successful-test-of-einsteins-gravity-with-gravity-probe-b"
  },
  {
    "body": "Francis Everitt and Bradford Parkinson at Vandenberg Air Force Base, 2003. Everitt became principal investigator of the Gravity Probe B experiment in 1981; Parkinson was co–principal investigator and project manager. Gravity Probe B.",
    "year": "2003",
    "heading": "Driving Innovation: Meet the Visionaries Behind Gravity Probe B's Groundbreaking Journey",
    "alt": "Two men in blue lab coats holding a large an object.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265426/Francis_and_Brad-Press_Day_mgtwwl.jpg",
    "uuid": "81b91831-0256-4c59-80ef-321ebb60782e",
    "anchor": "2003-driving-innovation-meet-the-visionaries-behind-gravity-probe-bs-groundbreaking-journey"
  },
  {
    "body": "Gravity Probe B solar array installation team at Vandenberg Air Force Base, 2004. GP-B was designed to measure two key predictions of Einstein’s general theory of relativity by monitoring the orientations of ultra-sensitive gyroscopes relative to a distant guide star. After decades of work by Stanford engineers and their partners, the experiment launched from Vandenberg Air Force Base on April 20, 2004. Gravity Probe B.",
    "year": "2004",
    "heading": "Launch of Discovery: Gravity Probe B Team Prepares to Test Einstein's Theories with Precision Gyroscopes",
    "alt": "A group of people, standing in front of an object.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265221/SA_inst_team-031804-1712w_b1i418.jpg",
    "uuid": "5169bc66-cc5b-461f-8ff1-73cbfb1fd0cc",
    "anchor": "2004-launch-of-discovery-gravity-probe-b-team-prepares-to-test-einsteins-theories-with-precision-gyroscopes"
  },
  {
    "body": "David Kelley, professor of mechanical engineering, speaking at the opening gala for a newly reconstructed building to house the Hasso Plattner Institute of Design (d.school), 2010. Kelley championed the concept of design thinking and was the first director of the d.school. Linda A.Cicero/Stanford News Service.",
    "year": "2010",
    "heading": "Designing the future: David Kelley celebrates the grand opening of Stanford's Hasso Plattner Institute of Design (d.school",
    "alt": "A man with glasses and a moustache is speaking into a microphone.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265223/david-kelley_ztssoh.jpg",
    "uuid": "fea53aa8-965c-486f-bf9a-e4d105d73fea",
    "anchor": "2010-designing-the-future-david-kelley-celebrates-the-grand-opening-of-stanfords-hasso-plattner-institute-of-design-dschool"
  },
  {
    "body": "The d.school’s early cohort in 2006 (clockwise from left): David Kelley, Bernard Roth, James Patell, Tina Seelig, Robert Sutton, Alex Kazaks, George Kembel, David Beach, Perry Klebahn, Julian Gorodsky, and Charlotte Burgess-Auburn. Courtesy d.school.",
    "year": "2006",
    "heading": "Founders of innovation: Meet the visionaries behind the d.school's inaugural cohort in 200",
    "alt": "A group of individuals seated on vibrant orange couches.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265402/dschoolcohort_brgwch.jpg",
    "uuid": "92fede4d-528e-4af3-9671-195b84570b00",
    "anchor": "2006-founders-of-innovation-meet-the-visionaries-behind-the-dschools-inaugural-cohort-in-200"
  },
  {
    "body": "Exterior of the Jerry Yang and Akiko Yamazaki Environment and Energy Building (Y2E2). Dedicated in 2008, Y2E2 became the first of the four buildings that composed the new Science and Engineering Quad. Named in honor of a gift from Jerry Yang (’90), cofounder of Yahoo!, and Akiko Yamazaki (’90), the building houses departments and institutes focused on studying and developing solutions for sustainability challenges, particularly climate change. Tim Griffith/School of Engineering.",
    "year": "2008",
    "heading": "Sustainable innovation hub: The Jerry Yang and Akiko Yamazaki Environment and Energy Building (Y2E2) opens its doors to tackle climate challenge",
    "alt": "People walking and cycling in front of a building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265195/br440jc7470_lhb21j.jpg",
    "uuid": "4ad74d27-c477-431b-919f-17c31e067221",
    "anchor": "2008-sustainable-innovation-hub-the-jerry-yang-and-akiko-yamazaki-environment-and-energy-building-y2e2-opens-its-doors-to-tackle-climate-challenge"
  },
  {
    "body": "Exterior view of the James and Anna Marie Spilker Engineering and Applied Science Building. Opening in 2010, the 100,000-square-foot Spilker Building was the second of the four Science and Engineering Quad buildings to be completed. When it opened, it housed the independent E. L. Ginzton Laboratory, offices for the Department of Applied Physics, and nanoscale facilities. Joel Simon/Stanford Engineering.",
    "year": "2010",
    "heading": "Engineering excellence: Unveiling the James and Anna Marie Spilker Building—a hub for applied science and innovatio",
    "alt": "An exterior view of the James and Anna Marie Spilker Engineering and Applied Science Building on Stanford University campus, showcasing its gorgeous architecture with a vibriant blue sky.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742266833/dz034ps1409_v9rkyg.jpg",
    "uuid": "7ae6bb0f-edf1-4da1-9f23-85ee25d55493",
    "anchor": "2010-engineering-excellence-unveiling-the-james-and-anna-marie-spilker-buildinga-hub-for-applied-science-and-innovatio"
  },
  {
    "body": "OVERLEAF: Aerial view of campus facing east, 2011. The new Science and Engineering Quad is visible on the left, with the final building still under construction. Then known as Building 4, that building would later become the Shriram Center for Bioengineering and Chemical Engineering. Linda A. Cicero/Stanford News Service.",
    "year": "2011",
    "heading": "Transforming the horizon: Aerial view of Stanford's campus showcases the emerging Science and Engineering Qua",
    "alt": "Aerial view of Stanford University's campus, showcasing its iconic architecture and lush green surroundings.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265141/aerial-campus-view-2011_owdrjo.jpg",
    "uuid": "c375f2bd-c728-4915-affa-06f35fd16817",
    "anchor": "2011-transforming-the-horizon-aerial-view-of-stanfords-campus-showcases-the-emerging-science-and-engineering-qua"
  },
  {
    "body": "Exterior and interior views of the Shriram Center for Bioengineering and Chemical Engineering, named after a gift from university trustee Kavitark “Ram” Shriram and his wife, Vidjealatchoumy “Vijay” Shriram. Opening in 2014, the Shriram Building completed the final phase of the new Science and Engineering Quad. Its 208,000 square feet house the Departments of Chemical Engineering and Bioengineering, along with teaching space and labs. Tim Maloney/School of Engineering.",
    "year": "2014",
    "heading": "Scientific advancement: The Shriram Center for Bioengineering and Chemical Engineering opens its doors, finalizing Stanford's Science and Engineering Qua",
    "alt": "A group of people strolls through a courtyard in front of a building.\r\n\r\nA spacious area where a women is sitting on a table multiple chairs arranged around it.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742266772/rb514kc0656_koxjid.jpg",
    "uuid": "10f12a69-d55b-494e-938d-15ffa4758222",
    "anchor": "2014-scientific-advancement-the-shriram-center-for-bioengineering-and-chemical-engineering-opens-its-doors-finalizing-stanfords-science-and-engineering-qua"
  },
  {
    "body": "Exterior view of the Jen-Hsun Huang Engineering Center. The Huang Center opened in 2010 as the administrative headquarters for the School of Engineering. Its 130,000 square feet contain the dean’s suite, offices, classrooms, a conference center, a library, and a café. It also exhibits displays of major Stanford Engineering milestones, including the original Yahoo! servers. Tim Griffith/School of Engineering.",
    "year": "2010",
    "heading": "Engineering leadership: The Jen-Hsun Huang Engineering Center opens as a hub for innovation and collaboration at Stanfor",
    "alt": "A panoramic view of the Jen-Hsun Huang Engineering Center on Stanford University campus, showcasing its modern architecture and vibrant green spaces.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265221/vr758kf1949_nv217v.jpg",
    "uuid": "07696a2c-2021-4d25-894b-b07ca3de3d11",
    "anchor": "2010-engineering-leadership-the-jen-hsun-huang-engineering-center-opens-as-a-hub-for-innovation-and-collaboration-at-stanfor"
  },
  {
    "body": "The palm-lined pathway into the new Science and Engineering Quad, with a distant view of the arched entry to the main quad. The SEQ was designed to align with the original plan for university construction and to maintain architectural consistency across campus buildings. Stanford Engineering.",
    "year": "2014",
    "heading": "Pathway to innovation: Palm-lined entrance to Stanford's Science and Engineering Quad harmonizes with campus heritage",
    "alt": "A walkway lined with tall palm trees on both sides, flanked by modern buildings. People walk along the path under a clear blue sky.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265190/fz107qj0976_elakil.jpg",
    "uuid": "6ad511e7-ae85-4839-8b1b-0b1efd7c8a2f",
    "anchor": "2014-pathway-to-innovation-palm-lined-entrance-to-stanfords-science-and-engineering-quad-harmonizes-with-campus-heritage"
  },
  {
    "body": "Aerial view of the four completed buildings that made up the new Science and Engineering Quad, facing southeast, 2014. Todd Quam/School of Engineering.",
    "year": "2014",
    "heading": "Bird's eye view: Completion of Stanford's Science and Engineering Quad showcases a new era of innovatio",
    "alt": "Aerial view of the Stanford Science and Engineering Quad.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265202/mb981vc1736_qaa7ma.jpg",
    "uuid": "c3bbadf2-aca5-4338-8c6a-5c613fff9a3b",
    "anchor": "2014-birds-eye-view-completion-of-stanfords-science-and-engineering-quad-showcases-a-new-era-of-innovatio"
  },
  {
    "body": "Computer science professor and future dean Jennifer Widom, promoting one of the first massive online open courses (MOOCs), 2011. Her course on databases was one of three available for free worldwide. Over time, the program has grown to include hundreds of courses with millions of enrollees. Stanford Engineering.",
    "year": "2011",
    "heading": "Leading the online education revolution: Professor Jennifer Widom launches one of Stanford's first MOOC",
    "alt": "A woman with short dark hair sits in front of a screen displaying \"Introduction to Databases\" with a red database icon.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265420/jennifer-widom_srdoc9.jpg",
    "uuid": "9ed89438-f0e2-4a22-9acc-a17f63f75d3c",
    "anchor": "2011-leading-the-online-education-revolution-professor-jennifer-widom-launches-one-of-stanfords-first-mooc"
  },
  {
    "body": "Andrew Ng (left) and Daphne Koller (above), cofounders of Coursera, 2014 and 2011. Originally developed by students as a platform to run Stanford’s massive open online courses (MOOCs), Coursera became a popular platform for delivering thousands of university courses and degrees to people worldwide. Ng photo: Norbert von der Groeben/School of Engineering; Koller photo: Linda A. Cicero/Stanford News Service.",
    "year": "2011-2014",
    "heading": "From classroom to cloud: Andrew Ng and Daphne Koller forge global learning revolution as cofounders of Courser",
    "alt": "A man in a blue shirt typing on a laptop, seated at a desk with multiple monitors.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265226/xm262js0452_pu6tmf.jpg",
    "uuid": "6624e0e2-afac-49f7-bf2d-e59b80edc7a5",
    "anchor": "2011-2014-from-classroom-to-cloud-andrew-ng-and-daphne-koller-forge-global-learning-revolution-as-cofounders-of-courser"
  },
  {
    "body": "A drawing of (left to right) Morris Chang, John Hennessy, and Jensen Huang at the event recognizing Chang as a Stanford Engineering “Hero” in April 2014. The panel is from the artist- rendered timeline of the collaboration and friendship between Morris Chang and Jensen Huang. Courtesy Morris Chang.",
    "year": "2014",
    "heading": "Celebrating collaboration: Morris Chang honored as a Stanford Engineering 'Hero' alongside innovators John Hennessy and Jensen Huan",
    "alt": "A comic panel shows three men at a Stanford Engineering event in 2014. One speaks into a microphone, praising Morris for TSMC's achievements.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265147/Cartoon_EWS_qtpizx.jpg",
    "uuid": "56f1057e-fe23-4faa-866a-2554f8fb8f25",
    "anchor": "2014-celebrating-collaboration-morris-chang-honored-as-a-stanford-engineering-hero-alongside-innovators-john-hennessy-and-jensen-huan"
  },
  {
    "body": "Sebastian Thrun, 2005. Along with the Stanford Racing Team, Thrun developed a driverless Volkswagen named Stanley that won an autonomous vehicle contest held by DARPA. The contest required participants to navigate a 132-mile course through the Mojave Desert in no more than ten hours—Stanley finished in just under seven. Linda A. Cicero/Stanford News Service.",
    "year": "2005",
    "heading": "Revolutionizing transportation: Sebastian Thrun and the Stanford Racing Team triumph with autonomous vehicle 'Stanley' at DARPA Challeng",
    "alt": "A man in a white shirt engages in conversation with a reporter.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265193/sebastian-thrun_ybkibn.jpg",
    "uuid": "c3fd717d-145f-4fa8-8157-9b8eac3a0908",
    "anchor": "2005-revolutionizing-transportation-sebastian-thrun-and-the-stanford-racing-team-triumph-with-autonomous-vehicle-stanley-at-darpa-challeng"
  },
  {
    "body": "The Stanford Racing Team’s autonomous robotic car, Stanley, in front of the William Gates Computer Science Building, 2005. Significant advances that enabled Stanley’s success included improved long-range terrain perception, real-time collision avoidance, and stable vehicle control on slippery and rugged terrain. Linda A. Cicero/Stanford News Service.",
    "year": "2005",
    "heading": "Engineering breakthroughs: The Stanford Racing Team's autonomous car 'Stanley' revolutionizes robotics and vehicle contro",
    "alt": "A Red Bull-themed blue Volkswagen car parked outside a building, with a crowd of onlookers nearby.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265182/stanley-2005_zwcpcx.jpg",
    "uuid": "bf47dfa5-f34b-4fde-8557-964a18ab7259",
    "anchor": "2005-engineering-breakthroughs-the-stanford-racing-teams-autonomous-car-stanley-revolutionizes-robotics-and-vehicle-contro"
  },
  {
    "body": "Karl Deisseroth, professor of bioengineering, 2017. In 2005, Deisseroth announced a novel way of activating individual genes in neurons using light. The technique, called optogenetics, allowed for new insights into animal behavior and the nervous system. He later developed a technique called CLARITY that revealed the brain’s structures in incredible detail. Steve Fisch, Stanford School of Medicine.",
    "year": "2017",
    "heading": "Illuminating the brain: Professor Karl Deisseroth pioneers optogenetics and CLARITY to unravel the mysteries of the nervous syste",
    "alt": "A  man dressed in a blue shirt looks at a device, reflecting a moment of focus and attention.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265197/Deisseroth_SteveFisch_zhdfl2.jpg",
    "uuid": "ad351a44-743f-4b51-bfe7-f3dec59503c8",
    "anchor": "2017-illuminating-the-brain-professor-karl-deisseroth-pioneers-optogenetics-and-clarity-to-unravel-the-mysteries-of-the-nervous-syste"
  },
  {
    "body": "Krishna Shenoy, professor of electrical engineering, 2012. Shenoy and his collaborators developed brain-computer interface technologies using implanted microchips and algorithms that interpreted neural signals. Their work led to advances enabling paralyzed people to move a computer cursor and, years later, to “type” with their thoughts. Joel Simon/Shenoy Lab.",
    "year": "2012",
    "heading": "Transforming lives: Professor Krishna Shenoy advances brain-computer interface technologies to empower individuals with paralysi",
    "alt": "A man in jeans and a shirt leans casually against a wall.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265205/Shenoy_MG_6677_jqo0uy.jpg",
    "uuid": "7c791c16-ed1b-4f73-a6c3-227810852ce2",
    "anchor": "2012-transforming-lives-professor-krishna-shenoy-advances-brain-computer-interface-technologies-to-empower-individuals-with-paralysi"
  },
  {
    "body": "Jennifer Dionne, second from right, and members of her lab (from left) Varun Dolia, Yirui Zhang, Liam Herndon, and Sajjad Abdollahramezani, 2023. The team uses a home-built microscope setup for rapid detection of respiratory pathogens and bacteria. Their innovative method capitalizes on ultra-densely patterned silicon sensors (over 5 million per square\r\ncentimeter) and acoustic bioprinting of surface chemistry to realize highly multiplexed, molecular-to-cellular detection at the point of care. Christophe Wu/School of Engineering.",
    "year": "2023",
    "heading": "Point-of-care innovation: Jennifer Dionne and her lab develop cutting-edge microscopy for rapid detection of respiratory pathogen",
    "alt": "A diverse group of five in protective eyewear collaborates in a dim lab, examining an object together.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265192/2023_08_11_110846_cezues.jpg",
    "uuid": "a61fd108-7771-4625-af11-5ddc85b49e94",
    "anchor": "2023-point-of-care-innovation-jennifer-dionne-and-her-lab-develop-cutting-edge-microscopy-for-rapid-detection-of-respiratory-pathogen"
  },
  {
    "body": "From left to right: James Gibbons, James Plummer, and John Hennessy at Plummer’s farewell party, 2014. Gibbons, Plummer, and Hennessy were each deans of Stanford Engineering. Plummer’s fourteen-year tenure was defined by achievements that expanded the scholarship of the school and created interdisciplinary connections with other schools. Rod Searcy.",
    "year": "2014",
    "heading": "Celebrating legacy: James Plummer honored at farewell party for his transformative leadership as dean of Stanford Engineerin",
    "alt": "Three men in suits standing side by side.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265427/bb752wg6044_ajr0ww.jpg",
    "uuid": "687d4310-5e8f-48c7-8459-e71b66e523ca",
    "anchor": "2014-celebrating-legacy-james-plummer-honored-at-farewell-party-for-his-transformative-leadership-as-dean-of-stanford-engineerin"
  },
  {
    "body": "Persis Drell, 2014. Drell, a professor of physics and former director of SLAC National Accelerator Laboratory, followed James Plummer as dean of Stanford Engineering. Saul Bromberger/Sandra Hoover.",
    "year": "2014",
    "heading": "Leading the charge: Persis Drell steps in as dean of Stanford Engineering, following a distinguished tenure at SLAC",
    "alt": "A woman with gray hair wearing a black and white top, smiling softly against a neutral background.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265191/PC0139_Persis_Drell_2014-09-05_2866_dsvp3h.jpg",
    "uuid": "96f8eae1-2e26-49ef-8925-441b1097dcd5",
    "anchor": "2014-leading-the-charge-persis-drell-steps-in-as-dean-of-stanford-engineering-following-a-distinguished-tenure-at-slac"
  },
  {
    "body": "A 3D bioprinter in Mark Skylar-Scott’s lab prints a sample of heart tissue, 2022. Andrew Brodhead/Stanford University Communications.",
    "year": "2022",
    "heading": "Printing the future of medicine: Mark Skylar-Scott's lab advances heart tissue engineering with cutting-edge 3D bioprinte",
    "alt": "A 3D printer actively creating a unique piece of art.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265167/3d-bioprinting_zzau8e.jpg",
    "uuid": "450d8d1f-f54f-487e-ab8a-103626593df4",
    "anchor": "2022-printing-the-future-of-medicine-mark-skylar-scotts-lab-advances-heart-tissue-engineering-with-cutting-edge-3d-bioprinte"
  },
  {
    "body": "Dean Persis Drell (center), Stanford President John Hennessy (right), and Jennifer Widom, before a faculty senate meeting held at the Central Energy Facility, 2015. Members of the senate toured the newly opened energy facility following the meeting. The system eliminates 150,000 tons of carbon dioxide annually and reduces total campus water use by about 15 percent. Linda A. Cicero/Stanford News Service.",
    "year": "2015",
    "heading": "Leading sustainability: Dean Persis Drell and Stanford leadership discuss environmental innovation at the Central Energy Facility tou",
    "alt": "A woman shows a document to a man while another woman reads paperwork, surrounded by blue safety helmets on a table.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265144/central-energy-facility-2015_nrngaz.jpg",
    "uuid": "be6ea414-2980-470b-b71c-b3e3d13c5dd7",
    "anchor": "2015-leading-sustainability-dean-persis-drell-and-stanford-leadership-discuss-environmental-innovation-at-the-central-energy-facility-tou"
  },
  {
    "body": "Jennifer Widom, 2017. A professor of computer science and electrical engineering, an expert in data and information management, and a pioneer in online engineering education, Widom had been on the faculty for twenty-seven years when she was appointed dean of Stanford Engineering in 2017 after Persis Drell became provost of Stanford. John Todd/Stanford Engineering.",
    "year": "2017",
    "heading": "Trailblazing leadership: Jennifer Widom appointed dean of Stanford Engineering, celebrating 27 years of academic excellenc",
    "alt": "A woman with short hair dressed in a red shirt, displaying a warm smile.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265201/Jennifer_Widom_preferred__High-Res_mbyvny.jpg",
    "uuid": "0e670e33-021c-418a-b6bf-6c9c7faf628e",
    "anchor": "2017-trailblazing-leadership-jennifer-widom-appointed-dean-of-stanford-engineering-celebrating-27-years-of-academic-excellenc"
  },
  {
    "body": "H.-S. Philip Wong, professor of electrical engineering, 2009. Wong served as codirector of the SystemX Alliance, a partnership between academia and industry. SystemX refocused an existing thirty-year program to create new materials and power sources, novel hardware and software, and coordination of these technologies through reliable control networks that would be needed for technologies of the future. Stanford Engineering.",
    "year": "2009",
    "heading": "Advancing innovation: H.-S. Philip Wong leads the way in collaborative research as codirector of the SystemX Allianc",
    "alt": "A man with short black hair and glasses smiles warmly.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265418/philip-wong-profile_EWS_h3zpoo.jpg",
    "uuid": "2e88c8b0-0e71-4600-b801-446f0a467966",
    "anchor": "2009-advancing-innovation-h-s-philip-wong-leads-the-way-in-collaborative-research-as-codirector-of-the-systemx-allianc"
  },
  {
    "body": "Jelena Vučković, professor of electrical engineering, 2023. A pioneer in quantum photonics, Vučković leads the Nanoscale and Quantum Photonics Lab. Her research focuses on developing semiconductor-based photonic systems for quantum and classical information processing and transforming photonics with inverse design techniques. School of Engineering.",
    "year": "2023",
    "heading": "Revolutionizing photonics: Professor Jelena Vučković at the forefront of quantum research and semiconductor innovatio",
    "alt": "A woman with glasses and dark hair smiles confidently outdoors.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265410/Jelena_Vuckovic_High-Res_tigsje.jpg",
    "uuid": "a43da795-115d-491c-8be0-9e6c51b0df47",
    "anchor": "2023-revolutionizing-photonics-professor-jelena-vukovi-at-the-forefront-of-quantum-research-and-semiconductor-innovatio"
  },
  {
    "body": "Electrical engineer Ada Poon developed the tiny “microstimulator” device to monitor health or deliver therapies deep inside the human body. The implant is one example of how researchers in Stanford’s SystemX Alliance are putting technology to work in new ways. Linda A. Cicero/Courtesy Poon Lab.",
    "year": "2016",
    "heading": "Transforming healthcare: Ada Poon's microstimulator device pioneers innovative health monitoring and therapy delivery inside the bod",
    "alt": "Tiny bug-like robot positioned beside a U.S. penny.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265212/Poon_microstimulator_w_penny_j5psr3.jpg",
    "uuid": "a418c93f-974c-4d8c-8789-ba412574fb74",
    "anchor": "2016-transforming-healthcare-ada-poons-microstimulator-device-pioneers-innovative-health-monitoring-and-therapy-delivery-inside-the-bod"
  },
  {
    "body": "Russ Altman, professor of bioengineering and genetics, recording The Future of Everything, 2018. The podcast launched as a SiriusXM radio show in 2017, later became a podcast, and transitioned to Stanford Engineering in 2022. In 2024, it surpassed 250 episodes. The show explores how the research and technological advances of today will lead to the innovations of tomorrow. Altman has interviewed faculty from across the university about their research. Amanda Law/School of Engineering.",
    "year": "2018",
    "heading": "Exploring tomorrow: Russ Altman hosts The Future of Everything podcast, showcasing cutting-edge research and innovations from Stanfor",
    "alt": "A man with glasses and headphones speaks enthusiastically into a microphone.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265178/russ_altman_gk8axg.jpg",
    "uuid": "8e688496-4b48-4aec-89cc-5a9cdd2da566",
    "anchor": "2018-exploring-tomorrow-russ-altman-hosts-the-future-of-everything-podcast-showcasing-cutting-edge-research-and-innovations-from-stanfor"
  },
  {
    "body": "John Etchemendy (left) and Fei-Fei Li, codirectors of the Institute for Human-Centered Artificial Intelligence (HAI), 2019. The university-wide, interdisciplinary institute launched with a mission to advance artificial intelligence research, education, policy, and practice to improve the human condition. The institute grew out of Stanford’s long-standing leadership in AI, dating back to the 1950s when John McCarthy coined the term. Drew Kelley, courtesy HAI.",
    "year": "2019",
    "heading": "Leading the future of AI: John Etchemendy and Fei-Fei Li codirect Stanford's Institute for Human-Centered Artificial Intelligenc",
    "alt": "A man and woman posing for a picture outdoors in front of a building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265401/Stanford_HAI_1381-_web_ylpw8q.jpg",
    "uuid": "a7257a43-4f17-4ed9-9add-ae0ae527093e",
    "anchor": "2019-leading-the-future-of-ai-john-etchemendy-and-fei-fei-li-codirect-stanfords-institute-for-human-centered-artificial-intelligenc"
  },
  {
    "body": "Environmental engineer Alexandria Boehm, 2024. When the COVID-19 pandemic struck, Boehm developed a new approach to detecting community-wide virus levels in wastewater, enabling health officials to track the prevalence of the virus in communities. Stanford Engineering.",
    "year": "2024",
    "heading": "Innovative solutions in public health: Alexandria Boehm pioneers wastewater monitoring to track COVID-19's community sprea",
    "alt": "A woman with dark hair in a bun smiles warmly, wearing a blue shirt and black blazer.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265408/AlexandraBoehm_01_Hi-Res_9828_ro1a88.jpg",
    "uuid": "b70e7e31-fabd-461a-9331-6949efe9b63a",
    "anchor": "2024-innovative-solutions-in-public-health-alexandria-boehm-pioneers-wastewater-monitoring-to-track-covid-19s-community-sprea"
  },
  {
    "body": "Clockwise from left: Stanford faculty Chris Piech and Mehran Sahami and senior lecturer Julie Zelenski, who together launched Code in Place for remote teaching during the COVID-19 pandemic lockdown, 2021. Code in Place brought Stanford’s most popular computer science course to thousands of students worldwide. One key to the program’s success was the more than nine hundred section leaders who volunteered to provide live, virtual support in multiple languages. Andrew Brodhead photo illustration.",
    "year": "2021",
    "heading": "Global learning revolution: Stanford's Code in Place brings computer science education to thousands during the pandemic, thanks to dedicated faculty and volunteer",
    "alt": "A laptop on a wooden table shows a video call with three people, alongside a glass of water, a plant, and a cell phone.\r\n",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265402/codeinplace_td2zef.jpg",
    "uuid": "24cf47b6-825f-4ece-8125-defa2e3df041",
    "anchor": "2021-global-learning-revolution-stanfords-code-in-place-brings-computer-science-education-to-thousands-during-the-pandemic-thanks-to-dedicated-faculty-and-volunteer"
  },
  {
    "body": "Pat Hanrahan, professor of computer science and of electrical engineering, 2020. Hanrahan and his Pixar colleague Edwin Catmull won the 2019 A.M. Turing Award. Hanrahan pioneered software that renders animation with photorealistic lighting, leading to multiple Academy Awards. His technology has been used in full-length motion pictures, video games, and in virtual reality. Andrew Brodhead/Stanford University Communications.",
    "year": "2020",
    "heading": "Illuminating animation: Pat Hanrahan, Turing Award winner, revolutionizes photorealistic rendering in film and virtual realit",
    "alt": "A smiling man poses with his arms crossed in front of an array of electronic equipment. ",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265419/hanrahan_pat_1_mxp4yf.jpg",
    "uuid": "f5c57c9e-c767-490f-93f5-a543ff87c742",
    "anchor": "2020-illuminating-animation-pat-hanrahan-turing-award-winner-revolutionizes-photorealistic-rendering-in-film-and-virtual-realit"
  },
  {
    "body": "Jeffrey Ullman, professor of computer science, 1987. Ullman was a corecipient of the 2020 A.M. Turing Award with his collaborator, Alfred Aho of Columbia University. The pair did seminal work in compilers and algorithms and influenced the entire field with their popular textbooks. Ed Souza/Stanford News Service.",
    "year": "1987",
    "heading": "Foundations of computing: Jeffrey Ullman honored with A.M. Turing Award for groundbreaking contributions to compilers and algorithm",
    "alt": "A black and white image of a man with a full beard, wearing a tie, sitting at a desk.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265415/jeffrey_ullman_azhmrn.jpg",
    "uuid": "eb294f3c-54ed-4ced-b26e-205299aa64ea",
    "anchor": "1987-foundations-of-computing-jeffrey-ullman-honored-with-am-turing-award-for-groundbreaking-contributions-to-compilers-and-algorithm"
  },
  {
    "body": "A public art display called Pars pro Toto, created by artist Alicja Kwade, installed in the Science and Engineering Quad courtyard, 2021. The twelve spheres range in size from 16 to 98 inches and are made of stone sourced from eight countries. The work was selected by a committee of faculty, students, and staff appointed by Dean Jennifer Widom. Andrew Brodhead/Stanford University Communications.",
    "year": "2021",
    "heading": "Artistry in science: Alicja Kwade's 'Pars pro Toto' installation enriches Stanford's Science and Engineering Quad with global inspiratio",
    "alt": "A landscaped campus courtyard featuring benches, large spherical sculptures, and trees.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265158/pars_pro_toto_orkqco.jpg",
    "uuid": "cca5b8bf-9848-4928-9ac1-04c51069ae22",
    "anchor": "2021-artistry-in-science-alicja-kwades-pars-pro-toto-installation-enriches-stanfords-science-and-engineering-quad-with-global-inspiratio"
  },
  {
    "body": "Carpentry shop, early 1900s. Special Collections & University Archives.",
    "year": "early 1900s",
    "heading": "A glimpse inside Stanford's Carpentry Sho",
    "alt": "Old photograph depicting a busy carpentry workshop, featuring men in aprons engaged in work under bright windows.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "d4392dd1-6c2b-424f-9d74-9ace8bbe96e8",
    "anchor": "early 1900s-a-glimpse-inside-stanfords-carpentry-sho"
  },
  {
    "body": "Product Realization Lab, 2023. Andrew Brodhead/Stanford University Communications.",
    "year": "2023",
    "heading": "Inside Stanford's Product Realization La",
    "alt": "Old photograph depicting a busy carpentry workshop, featuring men in aprons engaged in work under bright windows.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265213/00007001_0001.jpg_electrical_engineers_up1grc.jpg",
    "uuid": "2dd4bf38-6e73-4964-8951-fb4b4ced516a",
    "anchor": "2023-inside-stanfords-product-realization-la"
  },
  {
    "body": "Exterior of the Mitchell Earth Sciences Building with signage to mark the launch of the Stanford Doerr School of Sustainability, 2022. The Mitchell Building is the administrative home of the school. Stanford News Service.",
    "year": "2022",
    "heading": "New horizons in environmental education: Launch of the Stanford Doerr School of Sustainability at the Mitchell Earth Sciences Buildin",
    "alt": "A cyclist passes the Stanford School of Sustainability building.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265158/doerr_school_jdpsi0.jpg",
    "uuid": "0ede40ec-1567-4333-8994-677c31cd441c",
    "anchor": "2022-new-horizons-in-environmental-education-launch-of-the-stanford-doerr-school-of-sustainability-at-the-mitchell-earth-sciences-buildin"
  },
  {
    "body": "Arun Majumdar, professor of mechanical engineering, who became the inaugural dean of the Stanford Doerr School of Sustainability, 2022. Stanford’s first new school in seventy years arose out of ideas submitted by Stanford faculty, students, staff, and alumni as part of a university-wide long-range planning process. The Department of Civil and Environmental Engineering became joint with the new school, which also includes the Stanford Woods Institute for the Environment and the Precourt Institute for Energy. Edward Caldwell.",
    "year": "2022",
    "heading": "Forging a sustainable future: Arun Majumdar appointed inaugural dean of Stanford Doerr School of Sustainabilit",
    "alt": "Man in a blue suit stands confidently under stone arches.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265230/Majumdar_oyx924.jpg",
    "uuid": "2d14cc26-e24a-4481-8df9-8817e9a1bc42",
    "anchor": "2022-forging-a-sustainable-future-arun-majumdar-appointed-inaugural-dean-of-stanford-doerr-school-of-sustainabilit"
  },
  {
    "body": "Flexible, wearable, skin-like sensors developed by Zhenan Bao and her lab, 2024. The sensors, which use intrinsically stretchable transistors and integrated circuits, are designed to monitor human health, diagnose diseases, and provide opportunities for improved, autonomous treatments. Courtesy Bao Group.",
    "year": "2024",
    "heading": "Advancing healthcare technology: Zhenan Bao's lab unveils flexible, wearable skin-like sensors for health monitoring and disease diagnosi",
    "alt": "Two gloved hands stretch a transparent, flexible electronic sheet with a grid pattern against a clear blue sky.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265188/Fig.1d_qkhzka.jpg",
    "uuid": "22baddf4-532a-434d-97b1-3a998432e927",
    "anchor": "2024-advancing-healthcare-technology-zhenan-baos-lab-unveils-flexible-wearable-skin-like-sensors-for-health-monitoring-and-disease-diagnosi"
  },
  {
    "body": "ABOVE: A human diver with Ocean One, a humanoid robot designed by Oussama Khatib, professor of computer science, 2016. Ocean One is fitted with pressure sensors on each hand that provide a human pilot with a sense of touch. The robot successfully retrieved artifacts from the wreck of La Lune, the flagship of King Louis XIV. LEFT: Ocean One exploring La Lune, which sank in the Mediterranean Ocean off the coast of France. Frederic Osada/DRASSM/Stanford. ",
    "year": "2016",
    "heading": "Exploring the deep: Ocean One, Khatib's revolutionary humanoid robot, retrieves artifacts from the wreck of La Lun",
    "alt": "A scuba diver extends a fist to an orange underwater robot.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265149/Hoover_EmergingTechEvent_QE_11-14-23_PatrickBeaudouin_PTB_2163_kt5faz.jpg",
    "uuid": "72c2baa3-d62e-4066-8b9f-57ab70f9b06d",
    "anchor": "2016-exploring-the-deep-ocean-one-khatibs-revolutionary-humanoid-robot-retrieves-artifacts-from-the-wreck-of-la-lun"
  },
  {
    "body": "Amy Zegart (left) interviews Jennifer Widom at the Stanford Emerging Technology Review launch, 2023. In their conversation, Widom discussed how the Review allows engineering and science faculty to engage in a larger dialogue about the broader implications of their work in a way that is accessible to lay audiences, including policymakers. Patrick Beaudouin/Hoover Institution.",
    "year": "2023",
    "heading": "Bridging science and society: Jennifer Widom highlights the importance of the Stanford Emerging Technology Review at its launc",
    "alt": "Two women sit in armchairs on stage at a Stanford University event.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265149/Hoover_EmergingTechEvent_QE_11-14-23_PatrickBeaudouin_PTB_2163_kt5faz.jpg",
    "uuid": "8ad945e5-f959-421b-b886-53ccf349a1cf",
    "anchor": "2023-bridging-science-and-society-jennifer-widom-highlights-the-importance-of-the-stanford-emerging-technology-review-at-its-launc"
  },
  {
    "body": "LEFT TO RIGHT: Zhenan Bao, Allison Okamura, and Jennifer Widom prior to the Stanford Emerging Technology Review launch event, 2023. The School of Engineering and the Hoover Institution jointly launched the Review to capture diverse views from across Stanford on recent technological breakthroughs. Hoover Institution/Patrick Beaudouin.",
    "year": "2023",
    "heading": "Uniting voices in innovation: Zhenan Bao, Allison Okamura, and Jennifer Widom gather for the launch of the Stanford Emerging Technology Revie",
    "alt": "Three women in professional attire are engaged in a friendly conversation against a white wall.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265170/Hoover_EmergingTechEvent_11-14-23_PatrickBeaudouin_IMG_0478_s7ge4w.jpg",
    "uuid": "73ddf929-c2ae-40cc-ae37-e0e8c5469eb7",
    "anchor": "2023-uniting-voices-in-innovation-zhenan-bao-allison-okamura-and-jennifer-widom-gather-for-the-launch-of-the-stanford-emerging-technology-revie"
  },
  {
    "body": "Chemical engineer William Tarpeh, 2021. Tarpeh’s lab develops novel approaches to recover valuable resources from liquid waste streams, reducing environmental impact and enhancing sustainability. Rod Searcy.",
    "year": "2021",
    "heading": "Championing sustainability: Chemical engineer William Tarpeh pioneers innovative resource recovery from liquid waste stream",
    "alt": "Smiling man in a brown blazer stands outdoors.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265428/tarpeh_rod_searcy_hml0tu.jpg",
    "uuid": "121dea26-4b4c-475b-9380-6475211aaab3",
    "anchor": "2021-championing-sustainability-chemical-engineer-william-tarpeh-pioneers-innovative-resource-recovery-from-liquid-waste-stream"
  },
  {
    "body": "Exterior rendering of the Computing and Data Science building, opened in 2025. The building, nicknamed “CoDa,” is home to faculty from the Departments of Computer Science and Statistics, a cross-university data science initiative, and undergraduate programs in computer science, data science, and symbolic systems. Built jointly with the School of Humanities and Sciences, the building reflects the growing importance of data science in all areas of scholarship. LMN Architects.",
    "year": "2025",
    "heading": "Architectural milestone: Stanford unveils the Computing and Data Science Building ('CoDa') to foster interdisciplinary innovation in data researc",
    "alt": "llustration of a building's exterior with glass facades and a cylindrical section. ",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265152/SUBB_SD_Aerial_Garden_Court_jsfs5l.jpg",
    "uuid": "89f055e6-dc26-4dde-ba14-e51c9243c2ad",
    "anchor": "2025-architectural-milestone-stanford-unveils-the-computing-and-data-science-building-coda-to-foster-interdisciplinary-innovation-in-data-researc"
  },
  {
    "body": "Dean Jennifer Widom, center, with new graduate students at the Dean’s Welcome event, September 2024. Saul Bromberger/Stanford Engineering.",
    "year": "2024",
    "heading": "Welcoming future innovators: Dean Jennifer Widom hosts new graduate students at Dean’s Welcome Even",
    "alt": "A diverse group of smiling individuals wearing red \"Stanford Engineering\" T-shirts wave at the camera.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265232/WelcomeDay_GroupPhotos_9.26.24_01_O5A0256_ghau9a.jpg",
    "uuid": "83b1b394-bc4a-408b-9d0f-21a8f5bca36b",
    "anchor": "2024-welcoming-future-innovators-dean-jennifer-widom-hosts-new-graduate-students-at-deans-welcome-even"
  },
  {
    "body": "Mechanical Engineering student, 1970. Stanford News Service.",
    "year": "1970",
    "heading": "Engineering aspirations",
    "alt": "Researcher in a lab coat works intently on electronic components at a cluttered desk.",
    "image": "https://res.cloudinary.com/duv7bozlj/image/upload/v1742265175/mechanical_engineering_student_t9m8ee.jpg",
    "uuid": "2a8a20c3-bfba-459f-b57d-80f28212f3c8",
    "anchor": "1970-engineering-aspirations"
  }
]