[
  {
    "year": "1910-1915",
    "heading": "1910-1915 - The Engineering Corner",
    "body": "The southeast corner of Stanford’s main quad, known as “Engineering Corner,” circa 1910–1915.\r\nThe building was home to Engineering until 1977, when the school moved into the newly\r\nconstructed Frederick E. Terman Engineering Center. Special Collections & University Archives.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1910-1915_-_The_Engineering_Corner_lafzrp.jpg"
  },
  {
    "year": "1944",
    "heading": "1944 - Army Specialized Training Program",
    "body": "By 1944, more than half of the Army Specialized Training Program students at Stanford were in basic or advanced engineering. Thirteen hundred were taking basic engineering courses that included mathematics, chemistry, drawing, English, history, and geography. Four hundred fifty were advanced engineering students who, after completing the basics, went on to coursework in civil, mechanical, chemical, or electrical engineering. By comparison, at that time the school had only about one hundred graduate and upper-division civilian students specializing in engineering. Special Collections & University Archives.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1944_-_Army_Specialized_Training_Program_1_tsurqu.jpg"
  },
  {
    "year": "1944",
    "heading": "1944 - Army Specialized Training Program",
    "body": "Members of Stanford’s Army Specialized Training Program conduct  an electronics display outside the engineering buildings, January 1944. Special Collections  & University Archives."
  },
  {
    "year": "1944",
    "heading": "1944 - Stanford Engineering's third Dean",
    "body": "Fred Terman, dean of the School\r\nof Engineering, circa 1950. Samuel Morris recommended Frederick Terman to be his successor as\r\ndean of the School of Engineering. Terman, on leave from Stanford at\r\nthe time, had been serving since 1942 in a wartime appointment as\r\nhead of the top-secret Radio Research Laboratory at Harvard University.\r\nYet throughout the war, Terman was anticipating a period after the war he\r\nbelieved would be defined by unprecedented techno-\r\nlogical advancement led by engineers.\r\nDespite Terman’s absence, in December 1944 Stan-\r\nford President Donald Tresidder named Terman the third\r\ndean of the Stanford School of Engineering, with a strong\r\nendorsement from the engineering faculty. “Dr. Terman’s\r\nscholarly contributions in the field of electrical engineer-\r\ning and his administration of one of America’s largest war\r\nresearch projects place him among the outstanding engi-\r\nneers in the country,” Tresidder said, announcing Ter-\r\nman’s appointment. Terman would lead the\r\nSchool of Engineering through a now-legendary era of academic and technological innovation. Over the next\r\nten years, the School of Engineering would reach the\r\npinnacle of engineering education and lay the founda-\r\ntions of Silicon Valley. Special Collections & University Archives.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1737060927/1944_-_Stanford_Engineering_s_third_Dean_leujr9.jpg"
  },
  {
    "year": "1948",
    "heading": "1948 - Father of applied mechanics",
    "body": "Stephen P. Timoshenko teaching a class, 1948. A renowned expert, teacher, and writer widely regarded as the “father” of applied mechanics in the United States, he was born in the Russian Empire in 1878. Timoshenko taught at Stanford from 1936 to 1963 and was instrumental in the formation of the Division of Engineering Mechanics in 1949. Special Collections & University Archives.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861405/stephen-p-timoshenko_rr0uke.jpg"
  },
  {
    "year": "1951",
    "heading": "1951 - Edward L. Ginzton and the world's most powerful particle accelerator",
    "body": "Edward L. Ginzton with the Mark III linear accelerator, 1951. Ginzton earned his doctorate in electrical engineering at Stanford and was later appointed as a professor of electrical engineering and applied physics. He led a Stanford team that designed the world’s most powerful particle accelerator. Stanford News Service.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861406/prof-edward-2_xecpct.jpg"
  },
  {
    "year": "1953",
    "heading": "1953 - The first medical linear accelerator",
    "body": "Professor Edward Ginzton, left, and Dr. Henry Kaplan, a Stanford Medicine radiologist, in front of klystron gauges, circa 1953. Kaplan and Ginzton coinvented North America’s first medical linear accelerator, a 6-million-volt machine constructed at the Stanford Medical Center, then in San Francisco. The Stanford device was first used in 1955, soon after a similar device debuted in England. Stanford News Service.",
    "image": "https://res.cloudinary.com/dsqi5touf/image/upload/v1738861405/prof-edward-1_cfwklw.jpg"
  }
]